#+STARTUP: hideblocks
* Startup
#+NAME: startup
#+begin_src emacs-lisp :results silent
  (setq org-babel-python-command "~/anaconda3/envs/aoc/bin/python" org-src-tab-acts-natively nil)
#+END_SRC
* day6
** init_day6
   #+name: init_day6
   #+begin_src python :results value :cache yes
   from lib.autoloader import Autoloader
   puz_data_url = "https://adventofcode.com/2017/day/6/input"
   al = Autoloader(puz_data_url)
   al.connect()
   data = al.fetch()
   return data
   #+end_src

   #+RESULTS[9086cd299dc4e1c8f2682524e96cea85734941e0]: init_day6
   : 4	1	15	12	0	9	9	5	5	8	7	3	14	5	12	3
** day6-Common
 #+name: day6-com
 #+begin_src python :results output :var data=init_day6
   class mem_man():
       def __init__(self, mem_tab):
           self.mem_tab = [int(s) for s in mem_tab.split()]
           self.hist = set()

       def check_cur_state(self):
           cur_state = tuple(self.mem_tab)
           if cur_state in self.hist:
               return False
           self.hist.add(cur_state)
           return True

       def view_mem(self):
           print(self.mem_tab)

       def realloc(self):
           big_loc = 0
           for loc, vol in enumerate(self.mem_tab):
               if vol > self.mem_tab[big_loc]:
                   big_loc = loc
           cur_vol = self.mem_tab[big_loc]
           self.mem_tab[big_loc] = 0
           cur_loc = (big_loc+1) % len(self.mem_tab)
           while cur_vol > 0:
               self.mem_tab[cur_loc] += 1
               cur_vol -= 1
               cur_loc += 1
               cur_loc = cur_loc % len(self.mem_tab)

       def run_to_loop(self):
           counter = 0
           while(self.check_cur_state()):
               self.realloc()
               counter += 1
           return counter

       def run_to_loop_twice(self):
           self.run_to_loop()
           self.hist = set()
           return self.run_to_loop()

       def run_4_times(self):
           for ii in range(4):
               print(f"repeat? {self.check_cur_state()}")
               print(f"History: {self.hist}")
               print(f"Current State: {self.mem_tab}")
               self.realloc()
   mm = mem_man(data)
 #+end_src
 
** day6a
   #+name: day6a
   #+begin_src python :results output :var data=init_day6 :noweb yes
     <<day6-com>>
     counter = mm.run_to_loop()
     print(counter)
   #+end_src

   #+RESULTS: day6a
   : 6681

** day6b
   #+name: day6b
   #+begin_src python :results output :var data=init_day6 :noweb yes
   <<day6-com>>
   print(mm.run_to_loop_twice())
   #+end_src

   #+RESULTS: day6b
   : 2392
* day7
** init_day7
   #+name: init_day7
   #+begin_src python :results value :cache yes
   from lib.autoloader import Autoloader
   puz_data_url = "https://adventofcode.com/2017/day/7/input"
   al = Autoloader(puz_data_url)
   al.connect()
   data = al.fetch()
   return data
   #+end_src

   #+RESULTS[c88259a7aa9a20b32c1b14b10d45d972c724d20e]: init_day7
   #+begin_example
   uwzmqi (57)
   emlzcpy (106) -> pwmoihf, sdwnkb
   oevnzwt (90)
   imjhra (23)
   uuimn (299)
   xzpov (55)
   kynja (73)
   kggcnt (43)
   qdxpkx (67)
   wubltb (276) -> udcok, pihpjbp, hiifqwb
   anifo (10)
   zxdpmwl (57)
   tkdmopp (44)
   kdsbbcf (193) -> huyizg, evofb
   pxfpf (235)
   mjftixu (131) -> kwzsj, rspilzk, amtxw
   dbtoizo (73)
   fdqmg (124) -> kggcnt, dzekyo
   egvfxip (23)
   mpijek (63)
   kkoitqr (70)
   jgwvyp (29) -> hoagrj, swefql
   guipj (25) -> sauwet, graedp, jdvya, bmlwb, eidmza, kmnmx
   ayuhvb (216) -> bemhni, gvpac
   unmxfe (91)
   miwfyq (96)
   loofhh (31)
   liczn (12)
   urvunmn (63) -> ddsmt, oablvt
   jxdqhu (60)
   pvqfa (174) -> pftmymi, vmrdwe
   xrabl (82) -> ivyarjy, lhxinfd
   rfvtfs (93)
   qkrirn (129) -> ceztn, tqjmaxi, lwroef
   epnny (85) -> xltlyvw, ctkjip
   hlzyncx (85)
   fyxdfod (82)
   bawgh (7)
   sxpqvwv (358) -> oziwd, rreoxyc, qntqokn, acibw
   nogbp (119) -> psvkj, djyks
   mgdhu (15) -> cfcbhku, fltdrlc
   nsvan (1749) -> ahracx, dvoul, ecxayrz
   gefrwix (99) -> sovfoi, vdqpuon, ghtdnrx
   hfrtlx (57)
   kyhace (12)
   gbcfg (277) -> pzbgmxx, lysysqu, urvunmn, yiohbo, hqjlgre
   uhwsavi (57)
   fyynsgp (6)
   wqobawc (67)
   agjdl (61)
   tkureky (247)
   czalivu (28)
   wykyl (64)
   wqtbny (49)
   wnhkac (18)
   fuhbamv (81)
   wqudy (238) -> dpkdpj, jmmticn, kpotsk, qtntw
   latvu (35)
   inpjzmh (23)
   orawnkw (195) -> bsqlkiy, fhhzvwj
   kwzsj (40)
   ymfwoto (50)
   kckucu (152) -> mnoaa, infll
   fwlme (6)
   xlyxjyx (302) -> lewizr, duxfof, uqazvo, mzbwym
   aksgboa (93)
   rxxqpi (920) -> gwwphk, xaskpny
   gqqgsz (49)
   rlbdave (27)
   fuunnks (42) -> cstnc, dyxmvo, kwtszff, ittpbzy
   bhcwhrf (88)
   ppigbow (84)
   bbzhhk (70) -> bjrfinh, lissl
   hsael (60)
   tcpdvk (33)
   yvbgs (286) -> byaaoab, kebefwy, wpxxz
   utjtx (8) -> rzlkr, ntfvgoj, qmvpgee
   kdcyull (48)
   ldakuz (45)
   lcfpcst (92)
   ufnpup (102) -> cewmc, uwzmqi
   eavfy (87)
   lufgbo (60)
   sncjicb (102) -> xslucv, jbpvtf, gfltww
   lydjsu (65)
   aclnw (210)
   fqdtzfy (221) -> zwfly, bidasc, mjfhodb
   wavbwew (80)
   sqwfq (59)
   yeicqcy (46)
   chzrjqp (90)
   fhabfp (59)
   wbijkw (19) -> zzdbn, pqxef, ikzqhu, dyqgl
   gbhlxb (75)
   zpimcy (83)
   zmjzmyq (35)
   pagsex (45)
   onsjs (197)
   gqiczm (61) -> gwsceo, ucocdl, hdqow, fjqccm, oxvqjeh
   hmdqubz (16) -> juzol, txote, kynja
   lzikkl (330) -> cdrjh, lwbcn
   haadpw (65)
   eeluucp (62) -> pxsmani, qdmop
   nnsogp (60)
   nezhs (94)
   fqrwf (88) -> hujzcku, tkdmopp, ckgmjsg
   zoszls (70)
   uzlgko (56) -> loyjp, wwnkoz
   uqazvo (39)
   sphktgz (12)
   sikpe (48)
   rsjmc (53)
   htyvy (17)
   ylluriq (129) -> pawmnl, uhmnltu
   mrsxl (18)
   gbkubnt (45)
   xdvwjb (70)
   jguhhsb (9)
   mfyivv (84)
   etsxvmj (896) -> enlfaa, ymnichj, tuefd, zhkmnxk, vcllnn
   cougztw (27)
   ewifyk (25) -> sxino, vgwxuan
   vwtxaci (78) -> nnkpuhp, haadpw
   vwqof (64)
   cewmc (57)
   haztq (48)
   wxyhyh (43)
   dyxmvo (107) -> tnham, jsdvowc
   zhcmvvm (90)
   zdrwxqt (89)
   bluacvc (26)
   yxfysz (418) -> cfmcrf, ixbsb, kafyh, zouqjoo
   hiifqwb (14)
   knsphtv (74)
   xrwnzgz (21)
   xtbqb (82) -> bydmdru, awfnh
   zngystc (140) -> gszlkf, inkfmx
   gtktonk (92)
   ukkph (17)
   fzowmer (22)
   gumpsin (34)
   rynlaj (292)
   wjhgb (48) -> icoic, hwhgi
   ndvns (24)
   cawzw (81)
   kyphnel (51)
   uawyee (22)
   mzftrlb (70)
   xfxsxh (71)
   wzlonwk (65)
   inkfmx (30)
   vkkds (207) -> pvhdt, fshoj, dsuonma, vuazmuj
   wdwgd (80)
   licby (79)
   ytlpe (77)
   usddqi (170) -> fgokr, mdznc, psynxr
   ychaa (47)
   ztuswk (7)
   rtchnfd (162) -> eptve, lejuo
   bymrwvc (67)
   xqusi (22) -> jdbmary, flrdpaj, iwysxj, tooduon
   gyivxga (26) -> cldaf, lqgvx
   eptve (37)
   aflaj (35)
   ghnldf (35)
   oldfs (34)
   bkdxl (85)
   qsiqu (114) -> efvvtgo, hcfgf, fgayln, xzkzoq, isuevmr, xqyyni, rjfqyz
   abjrozg (189) -> dlcep, rhwfl
   fjemwxf (69) -> ofxdo, jjkns, mwvihj, vrhke
   zuapfco (40)
   tqcwn (50)
   ouycck (1843) -> lmliqa, txtnweq
   hkelse (71)
   wifvw (68) -> cpoxc, btlczl, dqzsblu
   cxfvbz (807) -> vazst, evquf, pvcpmx
   quxtc (142) -> tcpdvk, npwrqsm
   fltdrlc (90)
   fivaym (45)
   jdvro (43) -> wkkqsy, wdwgd
   qinwdk (178) -> liueudh, zgtsnwk
   zautz (48)
   flmeo (338) -> auocy, uqkhzxt
   zziuivt (78)
   iooqbyk (1558) -> fuhbamv, dqrsxx
   vumxuur (99)
   awfnh (60)
   woeabie (18)
   xtqnalt (19)
   xedlv (67)
   jatrdb (229) -> njnyoek, ctvhcv, qsgjk
   axjkbq (188) -> hgoruv, iimyku
   hmenje (183) -> npefyxi, fwoyu, acueoez
   zxwmd (96)
   zapbrn (421) -> szzhp, jsvwb
   tmwvxgi (179) -> egvfxip, gohxocn, wgvlq
   fkagr (32)
   wppgjkw (187) -> hlmdgp, usglf
   wajnp (54)
   hbgeak (92)
   rnbvott (157) -> kaekzo, hbozym
   haurusk (170) -> kxgrtg, ythbw
   ylpvre (48)
   zmuit (131) -> vrzrsz, uawyee, jbxllu
   mnoaa (59)
   zttpfsd (20)
   solmej (193) -> wnhkac, gkjafru, cmfwb
   lkzdum (33)
   vhpjrh (64)
   sqwejs (47)
   xxufma (17)
   eshjt (10)
   vrzrsz (22)
   pvhdt (23)
   dtqyhj (96)
   htmrm (85)
   tbsmz (70)
   hezjirm (54)
   cozhzk (62) -> fkagr, dqyaco
   jcrmny (70)
   zpadu (96)
   lfszf (50)
   vpnfkw (80) -> ewzvs, jbitbzb
   rphgr (895) -> gkfymj, rtchnfd, gtyfx, ujdhkyw
   bmlwb (481)
   mzaxe (52) -> itzntrm, wqtbny, jyhddhe, zgatapc
   qxzhq (180) -> ezjqb, kiceppo, zkiotrm, gqqgsz
   bkfxvy (1563) -> bkvuz, dbtoizo
   utaxgw (57) -> bupugpv, gnqxls, rnvenxi
   vcuizl (119) -> maklk, bxyvuvc
   ydbzo (57)
   lhagpts (737) -> utjtx, bcyipmu, vcuizl
   dkbycez (131) -> vagyecy, fvzfdr
   kdyuwjh (92)
   udcok (14)
   xssia (80)
   hrzvmel (34)
   dupdsj (81) -> hgsiz, yeicqcy, fncsm
   gseohkk (29)
   dllffsl (54)
   ixbsb (104) -> gjbikl, cogziqp, gdibw
   pqxpguz (22) -> tnpzf, zaxds, jvocm, eeluucp, zenvqu, ytqwzv
   abfkpur (651) -> ppeumu, yuvpdk, kzimilx, wbwyvyu, dkwbhuk
   khbth (270)
   vpvab (76) -> evgvano, ibfbn, xovrzf, qzbet
   iwotig (64)
   nomlh (74)
   oicxl (27)
   gqjhcw (5)
   cmfwb (18)
   assqm (23)
   tlyncze (36)
   pqkzpq (35) -> gjpcufw, ocmac, hohsf, qdtdbl
   zfxzq (58)
   vhlon (80)
   yiohbo (49) -> kwaqrgu, nezhs
   tymahpb (87) -> ladkvis, rlrcvv, fciadzu, xpigis, kckucu, kdrswra, khbth
   vcmntc (99)
   beigkn (86)
   pxzoq (16) -> mdimlja, hrufxbf, ufzrg
   wuwag (65)
   jdvya (385) -> zautz, haztq
   jbxllu (22)
   ashtupo (6)
   xgdyhva (893) -> tkureky, solmej, yucxy
   tooduon (92)
   decdq (43)
   ukhyz (95) -> ilnlkpv, bhzuzbt, agevvkl, byrfacr
   pgscbge (77)
   vdsjf (22)
   zqdoieb (53)
   sgtarpx (33)
   yhiby (100) -> tzljrvn, ckezp
   wdxfr (55)
   owxgj (37)
   uhmnltu (91)
   lsbzpu (6)
   ciwxuch (96)
   qskbft (200)
   gwwphk (79)
   kbarp (60)
   ygzas (55) -> ztyqti, nxapqfk
   shifzsw (54)
   huytmw (37) -> tsdfcgo, uqfbsti
   atwtz (58)
   ivcqfao (117) -> zqdoieb, bnmnak
   wifwhkq (80)
   ghtdnrx (1120) -> jcyxjwa, ftuvvv, nogbp
   ztsajt (128) -> grvqyf, yxsvp
   odmlf (60)
   hocfv (70)
   xegshds (53) -> upqkbq, hsdkmdv, ggxgmci, owjvny, gqiczm
   efulo (213) -> lzcikn, tihjcht
   jjkns (93)
   fedhzki (61)
   qtntw (294)
   airlbu (71)
   rzlkr (97)
   ogujo (49)
   jylgvd (165)
   immcgrm (47)
   hohsf (54)
   knzffuc (11)
   pwamvw (830) -> nvyaeal, tptcl, bbloz
   nifptxs (90) -> zapbrn, vhxgbd, hmenje, hlzape, ugaxscf, fjemwxf, arnbvk
   psvkj (81)
   acsqtk (128) -> ykcivtj, bhcwhrf
   ehgpqe (27)
   knxtlig (57) -> lhqhx, alkysnc
   sxino (50)
   hwhgi (86)
   glpwie (88) -> tzqux, uhwsavi, hfrtlx
   mrkknr (34)
   juxcxo (96)
   pxpeniz (41)
   buztc (76)
   ewhzc (60)
   bqpycy (253) -> snjfup, assqm
   oynlkiy (25)
   inful (168) -> knzffuc, ldgldpx
   sybsbk (27)
   towdptl (54)
   yujhec (30) -> qkzgb, nmwrqbx, dktkg, rnbvott, etingr
   nidvi (193) -> wjwit, dbuxj, rhpfhuc, ehyygbi
   ttkqf (85)
   iumsv (51)
   ijvrlpz (95)
   qqjvdh (76)
   mwznhh (17)
   ybwcod (63)
   yulcus (24)
   bcswm (96)
   lfjpkw (216)
   mjfhodb (18)
   dbuxj (20)
   ehyygbi (20)
   lgdbaig (4976) -> lplhe, sznyfy, tjrecaq
   odtgv (92)
   falrf (97) -> zttpfsd, zfaog, sdezdnz
   wyjnxf (12) -> bxipuq, ibosof
   icdptj (42) -> onlnhb, ibqenc
   lysysqu (237)
   vltkp (33)
   fwjufh (62)
   uqkhzxt (60)
   nbdfits (57)
   mtsju (42) -> tzevrtu, wflxu
   uxeyxk (88) -> ctmob, miwfyq, dtqyhj
   krrxx (27)
   tzevrtu (74)
   tjmeqt (50) -> sinrdj, bbrsdwl
   itzntrm (49)
   ehjpn (291) -> opbaea, kvxtl
   zayqjx (95) -> henlezn, vhpjrh
   cvzsvf (15)
   mmlsnw (63)
   agwpt (84)
   crfmd (70)
   jjpnqsk (29)
   otrlqy (56) -> hzbcp, qtcwngh
   smkcc (147) -> yalqeoe, uzjoy
   ztylsq (32)
   dvzoq (17)
   fyuitn (46) -> iumsv, fzmwc
   zkiotrm (49)
   ebhzgav (13) -> afooq, vihjl, xxoqrj, ipblpmy
   wgtmwjd (682) -> lsoto, abqknn, uzlgko
   kniivab (9) -> bymrwvc, aylzrt
   oxrpu (63)
   rsvcn (84)
   hgbvgnn (96)
   udlyr (227)
   ktaso (28)
   lmliqa (67)
   rcpscka (117) -> eduizfz, sholtl
   lzvpq (40)
   sixlpmr (310) -> ttrvo, onsjs, ppujydt, zmuit, dfzbuxo
   acibw (8)
   ftpwtol (98) -> sstby, wduscx
   pcfotkv (23) -> cszltz, pqdoti
   eknyvq (97)
   svxpx (66)
   nhyhkq (68)
   ttrvo (123) -> evpfdj, icdyfw
   hlbhkkr (80)
   bpuiaqr (96)
   azykbk (80)
   mnslyf (6) -> ouagp, wyjnxf, jxtzkel, vwtxaci, quxtc, yhiby, mgwiq
   yfngcvd (59)
   vfbhl (92)
   fhcrud (62)
   ggxgmci (66063) -> nsvan, qcbfbfz, anygv, gefrwix, kkeafw, jepbpw
   dlcep (74)
   aylzrt (67)
   ghxwug (84)
   auqfj (8)
   kdajj (40)
   wjjzh (96)
   njnyoek (21)
   lejuo (37)
   abeinmv (961) -> tlfklor, izqbvna, sxpqvwv, foqjjt, xqusi
   bkvaj (119) -> ktaso, ufqlean, czalivu
   npwrqsm (33)
   ysvbz (192) -> ekirg, lzvpq
   unhnq (5580) -> rvkalxi, kabbsvt, jwptb
   hqjlgre (47) -> jxxgurr, wvysxc
   kpotsk (294)
   nwand (344) -> vjtbtv, epnny, zdagr
   xbxqoh (40)
   ispeb (30)
   lznlhjd (33) -> qqjvdh, ribswz, ndebha, vsojq
   zlrboun (55)
   ofxdo (93)
   oxezpz (34)
   uqfbsti (73)
   zjljate (228) -> fzowmer, pcmgq
   kbxvke (195)
   uaxomk (87)
   udawli (6) -> eiliwle, ijvrlpz
   fnefss (348) -> qrtruk, ztsajt, aclnw
   hbampcd (10)
   czgws (57)
   anygv (3678) -> tghfe, ybzqi, fabacam
   qfxwzis (47)
   ullsjlc (99)
   yjarolt (69)
   cfefqhk (84)
   wflxu (74)
   icroy (52)
   ngkjtk (47)
   oqsdfwt (43)
   gswcnfo (93) -> gwnou, xedlv
   mdznc (19)
   zrdjlz (90)
   btlczl (205) -> sjoxehw, ucrqw
   xxyttn (228) -> dayjxl, melthx
   qrunwtc (208) -> rzyuyv, gjisc, zrqzlvd, sqwtiaf, kgnuc, ufnpup, lfjpkw
   hocvke (105) -> xzpov, btkih, kgijqnz
   luswe (7)
   whqrugy (77)
   ikkatj (76)
   hvdafm (590) -> gglig, nuorc, ioyesxg
   kyjjz (210)
   aqtgibg (84)
   byrfacr (93)
   tooqbdo (130) -> uaxsa, mcdpv, ccqsq
   zbthq (88)
   sboslk (27)
   mwvihj (93)
   ythbw (61)
   kgnuc (76) -> iuzfnx, kylauj
   xdnrao (194) -> wptxs, pdbtp
   nszphks (60)
   huyizg (24)
   ujapot (76)
   uycyz (2625) -> zzjwnh, ncirziy, icdptj
   xuzskid (54)
   xcvbgr (63)
   macpvga (239) -> fdqmg, hyqrffw, rfytg, idnhoqh, dchobfa, kyjjz, aqahah
   afrpf (29) -> ybbuy, uifanza
   klqmcsw (185) -> zvzdrp, luswe
   euglphc (165) -> jkyljso, abharn
   heiejhm (48) -> ndyceo, nvoys
   iulkkfp (112) -> pkwzp, cdzlq
   ucrqw (73)
   ivzps (58)
   lyhgmwz (12)
   ehwko (41)
   hasbi (124)
   pawmnl (91)
   kbtogma (96)
   dwwabne (6)
   wjwit (20)
   dktkg (232) -> ztuswk, iadezq, lhlyb
   iimyku (59)
   nlzohm (74)
   owgrt (6) -> zpimcy, xconx
   nyfdcz (61) -> zrdjlz, oevnzwt
   crihz (75)
   vehan (188)
   ucocdl (11321) -> sixlpmr, yujhec, uryldo, bgltopb, tpreug, gwwjmo, pwamvw
   urhawb (43)
   ztyqti (71)
   akmyzla (5)
   hdtmmh (61)
   vckxof (56) -> qpjgrr, lwejw
   ctvhcv (21)
   jdltlbx (92)
   yxsvp (41)
   xltlyvw (87)
   fatxilu (17)
   jljurl (14)
   wfold (83) -> affnbx, fhcrud, gcfqnlw, fwjufh
   mlavfvc (304)
   mhwqim (70)
   nemomq (62) -> jatrdb, nzrhtgr, ngyxxm, wnnnvgn, emlzcpy, haurusk, rynlaj
   jdbmary (92)
   icrilh (47) -> yolrh, cglbn
   ybzqi (395) -> pcfotkv, ewifyk, uredmot
   qvcpu (5)
   qzbet (255) -> miunk, horfum
   ckvji (42)
   jpcurr (9)
   stjxh (59)
   kucnmn (50) -> incbyp, ogujo
   vikstpo (80)
   sdezdnz (20)
   uticq (47)
   yynji (85)
   svnqa (313) -> nthqzh, uekit, hopiqm
   xmufp (1476) -> cozhzk, xvjkwcd, yzjmm, jzsmrz, zuzkw
   emdehy (42)
   usixdl (84)
   kgqhmx (27)
   wjnibfh (12)
   bvwdckm (47)
   icoic (86)
   aicos (78)
   kabbsvt (1459) -> rwtva, wykyl
   vuhehz (589) -> kdsmyax, tooqbdo, zizsy
   lwbcn (64)
   owjvny (68748) -> lgdbaig, yskay, uvftw
   moxxiw (480) -> apyhkb, uakqow, tutfkbo, zmiyzin, hgwupie, thtnmkb
   miunk (78)
   tjrecaq (5) -> dzxkea, fsckdb, dreryps, svnqa, qfegd
   twnon (66) -> ciwxuch, zpadu
   fciadzu (152) -> rmnfq, tnxxb
   pwmoihf (93)
   vsbbr (61)
   apyhkb (163) -> ixvot, dllffsl
   dkwbhuk (1778) -> wavbwew, hlbhkkr
   gnqxls (36)
   dlglddh (98)
   tlfklor (190) -> bwnvvei, thwgxk, thcth, gvphwwi
   pwyspt (240)
   eynrs (4953) -> gtvuq, vidgimw, fnefss, clmkbr, yxfysz, latvopy
   ntfvgoj (97)
   msxnd (45)
   atwsafs (245)
   incbyp (49)
   ktiuc (1175) -> mzaxe, xxyttn, tmwvxgi, azcuz, szkgky, beaubot, ffvahj
   hikmxhb (6)
   ctmob (96)
   zmiyzin (94) -> ryrig, sqwfq, mbpgrbi
   gjauauy (12)
   asymmuf (33) -> bwsbj, tfiynwo, zideon, xvkcms, jezdog, twnon, raloti
   aoscisa (12) -> mnyokhx, ppigbow, eubqww
   jbitbzb (54)
   wwnkoz (62)
   picati (50)
   kmnmx (481)
   lmdsuz (34)
   nqohnyo (99)
   rcvol (76)
   ccqsq (27)
   bsxjp (70) -> xcvbgr, gdidwas, hrhcwn
   uakqow (237) -> advexy, zkvrxb
   eckgtt (234) -> sofrfdv, nxygf, dbcrmjt
   azcuz (64) -> vetib, jirva
   hegyu (282) -> mfmrv, zwqpx, fyynsgp, hikmxhb
   ppbvdzh (47)
   snjfup (23)
   yjlzh (23)
   qcako (11)
   lplhe (1375) -> qrklawm, avytp, fqrwf
   gtyfx (110) -> vgvfksg, mmlsnw
   jsdvowc (76)
   beaubot (118) -> rscnige, dzjwel
   wgvlq (23)
   gjisc (192) -> liczn, lyhgmwz
   jdqmr (10)
   fjouck (19)
   xreip (84)
   ooeypdy (134) -> kgqhmx, vrvzkc
   beiih (2781) -> wuwag, xbhexk
   nroory (31)
   hswdm (45)
   kexrse (40)
   ahracx (1289) -> mhgdq, homcnz
   aksev (153) -> oqctx, cvzsvf
   hmzal (155) -> hsael, wltyw
   cldaf (97)
   iscnnvh (606) -> fzzyjt, xtbqb, vyzhqx, owtdq
   ibosof (98)
   lhkoebz (67) -> jnenlog, jblnqb
   slnoqn (21)
   ulhmjq (34)
   noqbv (8)
   xeppuz (7)
   fxpic (304)
   gktepby (64)
   gjkbf (67)
   qaugj (61)
   bbloz (51) -> icroy, rshqkfx
   pjiicj (67)
   ucqpz (39) -> dlglddh, tvhui
   rwgpcs (57)
   uzxovd (33)
   jqougaa (59)
   vrhke (93)
   kkeafw (1602) -> gbcfg, uodmc, mnslyf
   dcpqyp (6) -> soxzrwm, zxbirr
   ceztn (37)
   zwfly (18)
   yfriw (59) -> xdvwjb, crfmd
   gefbk (139) -> ivzps, atwtz
   dpkdpj (126) -> mfyivv, aqtgibg
   xpgzcxc (71)
   rymvvbq (118) -> qjtldq, bawgh
   bkpxd (20)
   tqjmaxi (37)
   phqyeg (90)
   xnzhkrn (54)
   niydyxq (33)
   upqkbq (26244) -> dfnak, szsny, ehkrs, eynrs, cbpsyx, bbixr, zsckv
   zcrgoy (17)
   zuphhfa (199) -> ospcnv, pkagrvq
   snhlzkk (428) -> iriyw, qdlcvk, mhium
   qtcwngh (67)
   jirva (92)
   nyqju (66) -> nszphks, kbarp, guivwse, nnsogp
   zdjxp (716) -> hhjdf, woiqeq, wfold
   schym (20) -> fgyndgv, hlqed
   ngyxxm (96) -> viqhzr, yylvwtf
   woiqeq (149) -> jslpd, pfjvzzw
   sthyxh (235)
   xbhexk (65)
   wnnnvgn (152) -> suqxa, wmhjbm
   xzixh (71) -> wdnjs, hlzyncx
   hwqhsc (235) -> akmyzla, tlekuus
   bidasc (18)
   pzbgmxx (156) -> vsevm, dwztnh, sybsbk
   ckjdqr (49)
   qdtdbl (54)
   dvoul (816) -> yfriw, klqmcsw, ueepet
   jkyljso (51)
   ugqjxlt (43)
   uazvt (57)
   qovrrvg (172) -> eboizv, rrqfy
   wgvxebc (62)
   iwysxj (92)
   gmtzu (30)
   rwtva (64)
   uulig (24) -> cqifjd, abjrozg, lgurkym, lznlhjd, lskrih
   nefive (168) -> opkjkav, kyphnel
   qsgjk (21)
   kgpymt (18)
   avytp (154) -> mdbixwm, mshht
   yskay (47) -> asymmuf, gnjkpwf, tlmnwl, iyekup, rphgr, mfohmwu
   mmyiwt (61)
   wfilxtb (50)
   iibjdbp (76)
   amtxw (40)
   ndyceo (86)
   vbqsm (250) -> jdqmr, hbampcd
   ttstqws (38)
   ybbuy (87)
   bfrmpr (101) -> dsjirbh, latvu
   vagyecy (52)
   rwlchj (73)
   vdqpuon (868) -> pykcpw, yioxr, lcgym, wbijkw, dupdsj
   zegoosj (36)
   emcstpe (71)
   pykcpw (168) -> bdkmsdy, mwznhh, zcrgoy
   ymnichj (909) -> jfhpd, xvedp, phswa, udawli, tjmeqt
   wlibbwd (5) -> nogjxu, bapvb, azykbk
   bncsnst (12)
   uxbnnor (76)
   zbodhfq (56)
   qhezs (93)
   drhmhn (18)
   hcfgf (197) -> tpfcmlm, xxxauxt, plcxnz
   cbomeum (35)
   qpjgrr (66)
   dsjirbh (35)
   lkoagx (58)
   szsny (5431) -> yvbgs, lcepfsw, exfeog, rxxqpi, fuunnks
   ytlzs (251) -> xnzhkrn, hezjirm, xuzskid, mwdqdbu
   dzxkea (322) -> cwevfy, mepeg, bvnfacp, tygpx
   xikuc (10)
   rmnfq (59)
   qfaubqr (82)
   sauwet (445) -> bsieig, mrsxl
   pdzfg (134) -> qfxwzis, ppbvdzh, rzwkjvu, sqwejs
   quryyds (78) -> tfshhr, wdxfr
   jvmuid (62)
   cpwfem (93)
   wratzd (22)
   fhdkp (232) -> sbhcx, kdcyull, sikpe
   agevvkl (93)
   xadsoxv (71) -> whqrugy, fmlyuv, yerfxa
   gvpac (51)
   ipsfv (211) -> bkpxd, xivvpur
   zprquyv (97) -> vrnxiui, htmrm
   akobg (1607) -> vcsdacf, udfmh, ambgac
   phxtzgu (78) -> exfffna, ewhzc, lufgbo, odmlf
   rreoxyc (8)
   jmmticn (24) -> chzrjqp, zhcmvvm, phqyeg
   woxpci (80)
   cvchqoz (24)
   qxnuj (70)
   tpfcmlm (20)
   hewjj (263) -> dwwabne, iwhazt
   adxox (79)
   bxyvuvc (90)
   opbaea (26)
   xcbliim (404) -> wonyy, drhmhn, kgpymt
   kzimilx (328) -> qmttkg, hpobvlt, pdzfg, zkborz, sbanx
   mtvoxu (54)
   qfggzok (67)
   vxtfjhq (23)
   hixeb (80)
   bkvuz (73)
   npozpo (98)
   uqhnekk (17)
   rhpfhuc (20)
   ribswz (76)
   mnyokhx (84)
   oleuqo (43)
   usbjyly (907) -> mjftixu, vldursw, ipsfv, pqkzpq, fkdauwn
   nkbtsr (19)
   szzhp (10)
   hgwbjzo (83) -> pnhxqna, zxwmd
   bubhosg (45)
   lxxkjb (45)
   yolrh (14)
   cdzlq (96)
   mbpgrbi (59)
   lqvrx (85)
   mmaqp (159) -> fsdlnh, ypmvfz
   ekirg (40)
   mdimlja (36)
   cxynfb (183) -> wcqsimj, kwxpb, jprkymy, yjlzh
   kgijqnz (55)
   bapvb (80)
   oqctx (15)
   bemhni (51)
   lcgym (199) -> anifo, eshjt
   hopiqm (31)
   ujdhkyw (136) -> yccqn, wfilxtb
   ygbphkw (2416) -> eujnekp, utaxgw, jylgvd
   occtbf (11)
   vhdke (7) -> wqtbb, buztc, trzjoi, brubv
   hpobvlt (186) -> lmdsuz, gumpsin, xpzzkdb, oxezpz
   bdprpzc (38)
   xcuid (26)
   txayxeg (146) -> ngkjtk, uticq
   ftuvvv (89) -> juxcxo, onmghy
   vgysxct (103) -> cygpuh, svxpx
   nxapqfk (71)
   kylauj (70)
   amyymhg (52)
   jjpco (92)
   mgmoe (45)
   sinrdj (73)
   rzclv (91)
   ahcjog (59) -> yhhob, rvbbn, cawzw
   saqcb (64)
   cfmcrf (126) -> phmqb, xeppuz
   uluavyz (311)
   rzyuyv (182) -> uqhnekk, yqpivvl
   ckezp (54)
   ljihfp (71)
   plcxnz (20)
   uguqde (18)
   scdvmta (40)
   sofrfdv (28)
   sahfob (87)
   lzcikn (30)
   gdidwas (63)
   xqyyni (227) -> sjiaux, dwkkssy
   yoibok (50)
   wjgdz (54)
   uifanza (87)
   ufzrg (36)
   kwxpb (23)
   vmrdwe (13)
   yucxy (65) -> mpedpht, jhzoyme
   xuzvwcg (23) -> bluacvc, xcuid
   wrbtgkb (45)
   abqknn (142) -> kialkdr, xtqnalt
   dklrle (46)
   lhqbgck (632) -> ykcxtea, zjljate, ysvbz, qovrrvg
   smzpa (114) -> jugwirf, ttborca, tmuuyka
   fwoyu (86)
   dgkhq (64)
   tvhui (98)
   clyht (10)
   sspem (80)
   pgpvnb (39)
   zkborz (322)
   liueudh (63)
   myrlvj (63)
   cszltz (51)
   ambgac (34)
   pwznn (120) -> cougztw, krrxx
   iwhazt (6)
   hgoruv (59)
   gglig (156) -> saqcb, mubenp, vwqof
   bwnvvei (50)
   ezjgtbp (71)
   xzkzoq (73) -> gtktonk, odtgv
   qkzgb (219) -> ukkph, zrsya
   cphgovc (269) -> nnqghfo, ohjvf
   bdkmsdy (17)
   hzbcp (67)
   btkih (55)
   ejyho (96)
   ecagt (7)
   vhxgbd (267) -> lkoagx, vrjfn, zfxzq
   estka (47)
   tihjcht (30)
   tcaemi (171)
   bnmnak (53)
   jtendcr (85)
   uekit (31)
   jbpvbc (168) -> caukzx, pjiicj
   pdbtp (91)
   gjpcufw (54)
   bvnfacp (21)
   dqzsblu (91) -> wzlonwk, ywxkr, iggqobg, lydjsu
   fjekad (48)
   juzol (73)
   dfzbuxo (17) -> fdrki, ufmlfmj, jxdqhu
   dombfx (57) -> oxrpu, ybwcod
   eidmza (481)
   advexy (17)
   ddleaoo (71)
   bcyipmu (229) -> aflaj, cbomeum
   rsttknu (97) -> bsxjp, bmzeddf, ndwvmg, glpwie, exbgy
   tnham (76)
   zideon (236) -> occtbf, hmltq
   gfltww (51)
   eduizfz (79)
   fsdlnh (54)
   jugwirf (51)
   yylvwtf (98)
   npefyxi (86)
   gszlkf (30)
   wptxs (91)
   amntev (61)
   hlqed (76)
   rvbbn (81)
   sygyji (6)
   wcqsimj (23)
   fjqccm (14455) -> tymahpb, ouycck, ehazo
   gcfqnlw (62)
   nnbokwt (194) -> mngea, hcajnu
   bxipuq (98)
   izqbvna (250) -> zoszls, kkoitqr
   zxbirr (83)
   nkipkdo (72)
   yuvpdk (1257) -> gswcnfo, vceutc, kahwlj
   eiliwle (95)
   ohjvf (99)
   cvkmmqc (54)
   cdvscgo (44) -> tjmyc, phxtzgu, ayuhvb, eckgtt, wubltb
   trzjoi (76)
   zzdbn (50)
   wonyy (18)
   woxmeo (56)
   enohjb (206) -> bkdxl, ttkqf
   sznyfy (1243) -> xkfxnp, aoscisa, bbzhhk
   phbapzv (50)
   gkfymj (92) -> fbvhl, nkipkdo
   hmltq (11)
   kafyh (36) -> eincbt, amyymhg
   pbkmeod (78) -> estka, ychaa
   fgyndgv (76)
   kunhp (19) -> rqpbivd, kdyuwjh
   vruhp (227) -> woxpci, hixeb, sspem
   jirnr (24)
   kaekzo (48)
   dsuonma (23)
   xdxhzm (893) -> sncjicb, mmvhi, brchwcm, gefbk
   bxpfs (92)
   qdzbmhn (1640) -> xrabl, pwznn, dvzguq
   aplke (19)
   veuqzjh (25)
   tpreug (377) -> axjkbq, hegyu, nyqju
   fpmvb (17)
   hlmdgp (78)
   wbgwke (19)
   dzjumb (43)
   clmkbr (482) -> hasbi, pxzoq, ecfquya, coezio
   affnbx (62)
   ignblg (123) -> txeege, owxgj
   ehqlqj (40)
   vulynlf (18)
   tghfe (89) -> usddqi, zuphhfa, rjzbhh
   mdbixwm (33)
   fdrki (60)
   ggxhzhd (10) -> masck, amntev
   obejsk (99)
   eubqww (84)
   auocy (60)
   pqxef (50)
   lhlyb (7)
   tfiynwo (174) -> emdehy, zgtzox
   jezdog (58) -> wvxvu, picati, tnisesh, yoibok
   zizsy (89) -> hdtmmh, mmyiwt
   ufmlfmj (60)
   maklk (90)
   oxvqjeh (17638) -> xscyb, wzjsbdm, lzikkl, xlyxjyx, flmeo, xcbliim
   mmvhi (113) -> xpgzcxc, ddleaoo
   yalqeoe (38)
   ecfquya (32) -> vlfpib, dklrle
   sagihe (940) -> bicpqwm, dyfptec, kbxvke, mgdhu
   kiceppo (49)
   tnpzf (114) -> ewrcce, jqougaa
   vceutc (29) -> nqohnyo, vumxuur
   uzdzkal (32)
   csotuo (34)
   xlufw (93)
   hdqow (10132) -> uulig, macpvga, bkfxvy, zdjxp, akobg, vjboadc
   rfqquyg (92)
   sqwtiaf (30) -> aksgboa, qhezs
   lamrqdl (59)
   ittpbzy (101) -> jrkbskn, tqxfj
   vjboadc (1160) -> dombfx, aksev, huytmw
   iriyw (193) -> vxzgkqa, fjouck
   hiftfo (88)
   bsqlkiy (20)
   hzkeiu (16)
   arnbvk (329) -> zbodhfq, woxmeo
   pxsmani (85)
   jfapwfu (28) -> qhsptw, oqsdfwt, rsaitjm, decdq
   jrkbskn (79)
   zouqjoo (140)
   wduscx (86)
   vetib (92)
   qtfroa (112) -> pxpeniz, ehwko, ujfmq
   wgqnrc (30)
   nvyaeal (29) -> mpijek, myrlvj
   vsevm (27)
   cdxwbv (23)
   tzqux (57)
   qkqgwsl (19)
   ykcivtj (88)
   tsdfcgo (73)
   aqahah (68) -> airlbu, tgvqqn
   jddzj (11)
   zuzkw (16) -> sqfue, zlrboun
   rdizbi (30)
   lhxinfd (46)
   sjiaux (15)
   zfaog (20)
   tgsdks (18)
   dreryps (38) -> rfqquyg, jdltlbx, obqactw, hbgeak
   xkfxnp (72) -> ejyho, hgbvgnn
   qrtruk (63) -> ckjdqr, dtmhqm, tzdntld
   mgwiq (16) -> wjjzh, kbtogma
   sjoxehw (73)
   jbpvtf (51)
   gjtpl (48)
   hrhcwn (63)
   igkso (40) -> tqfzh, gbhlxb
   cygpuh (66)
   fckfbce (105) -> jtendcr, fcutr
   yerfxa (77)
   vjtbtv (77) -> unmxfe, rzclv
   ppujydt (23) -> pujhjf, lvwwxt
   qmvpgee (97)
   kdrswra (102) -> xreip, ghxwug
   oablvt (87)
   latvopy (38) -> smmnc, quryyds, vyptki, hgchigs, vckxof
   uaxsa (27)
   lissl (97)
   xovrzf (331) -> ehqlqj, scdvmta
   homcnz (62)
   crsjegg (21) -> iooqbyk, qrunwtc, bumibye, lhqbgck, sagihe, vpvab
   pkagrvq (14)
   thcth (50)
   nogjxu (80)
   hhjdf (207) -> wgvxebc, jvmuid
   ipblpmy (46)
   qmttkg (94) -> ohohls, zxdpmwl, czgws, ydbzo
   qjtldq (7)
   iggqobg (65)
   hhfgih (152) -> wratzd, vdsjf, tbynt, hlzzxi
   xvjkwcd (40) -> oleuqo, urhawb
   fabacam (305) -> dlcxjg, dlactl, falrf
   xvrgg (77)
   fshoj (23)
   uredmot (55) -> zmjzmyq, ghnldf
   psynxr (19)
   dtiprc (61)
   pevdihc (135) -> rbmoj, hiftfo
   jxtzkel (132) -> bdprpzc, ptfeyky
   uvftw (1277) -> hvdafm, xgdyhva, vvndbk, gwkfb, cdvscgo, lhagpts
   jvocm (114) -> lamrqdl, stjxh
   zgtzox (42)
   fzmwc (51)
   aopwj (77)
   vgeln (89)
   nvwknv (47)
   vrvzkc (27)
   sholtl (79)
   guivwse (60)
   gjbikl (12)
   kdsmyax (51) -> vhlon, vikstpo
   dyqgl (50)
   uqjsosg (67)
   kahwlj (79) -> nlzohm, nomlh
   lqgvx (97)
   sstby (86)
   sgcmty (77)
   hgchigs (34) -> djktoc, aopwj
   ouagp (24) -> lcfpcst, bxpfs
   tsahe (106) -> gjkbf, uqjsosg
   psjbb (86)
   vrjfn (58)
   rjzbhh (91) -> sarppfb, nhyhkq
   melthx (10)
   nuorc (40) -> ytlpe, fvhfru, xvrgg, kbdbe
   mubenp (64)
   mqtxqmz (12) -> lqvrx, chczyg
   ypmvfz (54)
   txote (73)
   vxzgkqa (19)
   bbrsdwl (73)
   xconx (83)
   enlfaa (479) -> djquz, sthyxh, hkuay, hmdqubz, qxccjtw, vgysxct
   wbwyvyu (13) -> hmzal, fckfbce, fqdtzfy, hgwbjzo, hewjj, rcpscka, cxynfb
   cvrph (145) -> dbdrdzo, acdahz
   izsgfu (64)
   jcexcl (18)
   oacoxb (1336) -> msazzkr, jbpvht
   acdahz (83)
   afooq (46)
   fkdauwn (187) -> aynknet, uzdzkal
   mpedpht (91)
   lcepfsw (218) -> schym, pbkmeod, ntodfz, owgrt, dcpqyp
   xscyb (458)
   pujhjf (87)
   jtankmh (190)
   pxctb (71)
   tqfzh (75)
   jzsmrz (126)
   nzrhtgr (150) -> ezjgtbp, xfxsxh
   tnxfqf (34)
   djquz (211) -> fwlme, lsbzpu, ashtupo, gbauyfh
   jyhddhe (49)
   wdnjs (85)
   byaaoab (186) -> ikhsv, pgpvnb
   bumibye (997) -> xzixh, kdsbbcf, nyfdcz
   frffchv (33)
   cogziqp (12)
   brchwcm (27) -> uxbnnor, iibjdbp, qupaz
   fbvvzp (304)
   tnisesh (50)
   henlezn (64)
   kbdbe (77)
   vojpfo (43)
   psxqu (61)
   fvzfdr (52)
   rvkalxi (77) -> vlzbp, jbpvbc, muvvvu, xadsoxv, ahcjog
   abharn (51)
   gegdmus (42)
   hfdjtw (43)
   zoqmn (54)
   vgwxuan (50)
   pjukxu (76) -> ikkatj, ujapot, rcvol
   oziwd (8)
   evgvano (411)
   evquf (195)
   gkjafru (18)
   ygwxr (144) -> ylpvre, cabbtti
   dniumoe (83) -> wajnp, mtvoxu, towdptl, kmiax
   tlekuus (5)
   mrchmw (43) -> xssia, wifwhkq
   ueepet (113) -> ugoetwf, hfdjtw
   znzsgk (98)
   cabbtti (48)
   cbpsyx (1290) -> nifptxs, oxzecjg, uycyz
   ulqnjx (18)
   ezjqb (49)
   xvkcms (212) -> vxtfjhq, imjhra
   kxgrtg (61)
   hxtbym (50)
   pqdoti (51)
   lizkruo (15)
   zzjwnh (130) -> ehgpqe, oicxl
   mzbwym (39)
   nkixmeh (32)
   xxxauxt (20)
   caukzx (67)
   zenvqu (124) -> sboslk, fwudfax, rlbdave, onqnmbp
   ivyarjy (46)
   ldgldpx (11)
   grvqyf (41)
   hlzzxi (22)
   jsvwb (10)
   cglbn (14)
   swefql (99)
   zgtsnwk (63)
   hlzape (373) -> fatxilu, htyvy, fpmvb, xxufma
   lqylns (82) -> inful, igkso, mtsju, otrlqy, jtankmh, vorviq
   iouzha (161) -> slnoqn, gmmkqp
   kwtszff (119) -> bkfqmqn, tbsmz
   rqpbivd (92)
   bupugpv (36)
   zaxds (66) -> ygywjq, pusxipi
   onmghy (96)
   jnenlog (78)
   sovfoi (97) -> uluavyz, vhdke, kuivtq, ylluriq, cvrph, pevdihc
   cfcbhku (90)
   tgvqqn (71)
   ncirziy (48) -> ulhmjq, zwoqof, hrzvmel, vrbss
   obqactw (92)
   udfmh (34)
   hgsiz (46)
   bicpqwm (177) -> sygyji, bjfou, qsche
   jslpd (91)
   pcmgq (22)
   graedp (89) -> npozpo, znzsgk, jxvses, teikos
   pnhxqna (96)
   cwwdl (73)
   msazzkr (28)
   mngea (23)
   gohxocn (23)
   qfqnrvt (4602) -> ptwedjj, xdxhzm, qsiqu
   rsaitjm (43)
   lwroef (37)
   jbpvht (28)
   wjovhv (35) -> gokngb, vczph, phbapzv, tqcwn
   nsabyg (99)
   tvbswr (45)
   fwbly (134) -> dzjumb, ugqjxlt
   hrufxbf (36)
   wltyw (60)
   ptfeyky (38)
   jwptb (1539) -> yulcus, ndvns
   qxccjtw (178) -> wbgwke, arqqbb, qkqgwsl
   ewrcce (59)
   oxzecjg (2983) -> eknyvq, myypsh
   dwkkssy (15)
   gnxiznu (126) -> nroory, loofhh
   bejncv (38)
   qcbfbfz (2322) -> vuhehz, lqylns, wgtmwjd
   pkwzp (96)
   owtdq (103) -> frffchv, lkzdum, sgtarpx
   mdauzot (240)
   alkysnc (73)
   gtvuq (898) -> zuapfco, kexrse
   eewbbvo (70)
   jfhpd (196)
   mshht (33)
   sbanx (204) -> fhabfp, yfngcvd
   pusxipi (83)
   mwbvrhn (182)
   fbvhl (72)
   ulvmck (1649) -> bfrmpr, tcaemi, gkvrrq
   yproaz (18)
   bgltopb (866) -> bpbik, kniivab, quyasfd
   nnkpuhp (65)
   bhzuzbt (93)
   tcbrhdi (87)
   guzycwt (34)
   jdabb (61)
   fsckdb (268) -> yjarolt, dewtepm
   yfkyv (45)
   hyqrffw (146) -> ztylsq, nkixmeh
   ctkjip (87)
   vularzu (93)
   ygywjq (83)
   xzjcf (1843) -> mmaqp, euglphc, smzpa, zprquyv
   jblnqb (78)
   dbcrmjt (28)
   dewtepm (69)
   zdagr (249) -> gqjhcw, qvcpu
   jepbpw (383) -> tgwmbza, wifvw, nwand, tyjrdme, snhlzkk
   duxfof (39)
   tzljrvn (54)
   smmnc (20) -> agwpt, cfefqhk
   vgvfksg (63)
   ugaxscf (289) -> vtneuhy, bfcab
   tbynt (22)
   hkuay (121) -> bejncv, fpqpmca, ttstqws
   eujnekp (7) -> licby, adxox
   exfeog (853) -> crihz, xuzvwcg, icrilh
   gmmkqp (21)
   qfegd (228) -> vgeln, zdrwxqt
   lewizr (39)
   teikos (98)
   bwsbj (216) -> xrwnzgz, hydfd
   frzwdkn (11)
   fgokr (19)
   cwevfy (21)
   dzekyo (43)
   tmuuyka (51)
   njppj (23)
   eboizv (50)
   gvphwwi (50)
   vidgimw (534) -> dsstjf, fyuitn, kucnmn
   wmhjbm (70)
   zkvrxb (17)
   gwnou (67)
   pihpjbp (14)
   lwejw (66)
   fmlyuv (77)
   rtstdkd (47)
   kmiax (54)
   vyptki (98) -> mgmoe, msxnd
   gwkfb (1238) -> ggxhzhd, rymvvbq, wvwiwua
   wvwiwua (108) -> wjnibfh, exiwwbx
   shilhu (67)
   bpbik (97) -> cdxwbv, zchxtxj
   hssgk (14)
   hujzcku (44)
   tjmyc (258) -> gmtzu, rdizbi
   vhjfcw (191) -> yproaz, tgsdks
   ewzvs (54)
   qsche (6)
   rxwtoee (30)
   muvvvu (167) -> gbkubnt, lxxkjb, vjdrrnk
   sbhcx (48)
   vvndbk (953) -> jgwvyp, udlyr, vhjfcw
   nnqghfo (99)
   coezio (70) -> jcexcl, woeabie, uguqde
   zchxtxj (23)
   rfytg (142) -> oldfs, mrkknr
   ndtsa (7)
   qrklawm (78) -> emcstpe, pxctb
   ladkvis (99) -> nbdfits, uazvt, rwgpcs
   ewiugad (167) -> uzxovd, vltkp, niydyxq, yxknolf
   yioxr (150) -> njppj, inpjzmh, nbfpp
   exfffna (60)
   rrqfy (50)
   sdwnkb (93)
   rshqkfx (52)
   fvhfru (77)
   tutfkbo (187) -> ckvji, gegdmus
   vlfpib (46)
   lsoto (148) -> fwjnm, hzkeiu
   ecxayrz (63) -> wutzd, vbqsm, nefive, ftpwtol, hocvke
   urexzjf (187) -> wxyhyh, vojpfo
   nbfpp (23)
   rspilzk (40)
   zgatapc (49)
   vcsdacf (34)
   rnvenxi (36)
   mcdpv (27)
   oieuzv (25)
   txtnweq (67)
   sarppfb (68)
   wpxxz (20) -> fedhzki, vsbbr, psxqu, jdabb
   usglf (78)
   ujfmq (41)
   fpqpmca (38)
   yxknolf (33)
   ppeumu (517) -> mrchmw, bkvaj, iouzha, knxtlig, jdvro, afrpf, kunhp
   acueoez (86)
   foqjjt (294) -> fjekad, gjtpl
   dyfptec (105) -> ispeb, wgqnrc, rxwtoee
   idnhoqh (70) -> mzftrlb, qxnuj
   vrnxiui (85)
   tgwmbza (1064) -> aplke, tqnqxx, nkbtsr
   mhgdq (62)
   yccqn (50)
   bbixr (4503) -> xmufp, moxxiw, nemomq
   aynknet (32)
   cdrjh (64)
   hgwupie (115) -> aicos, zziuivt
   fwjnm (16)
   qhsptw (43)
   ptwedjj (33) -> xdnrao, enohjb, uxeyxk, qxzhq, fhdkp
   jxvses (98)
   xvedp (50) -> cwwdl, rwlchj
   jxxgurr (95)
   etingr (217) -> ulqnjx, vulynlf
   bsieig (18)
   mhium (203) -> hssgk, jljurl
   vlzbp (286) -> auqfj, noqbv
   suqxa (70)
   dlcxjg (17) -> mhwqim, jcrmny
   xpigis (270)
   ehkrs (11) -> ulvmck, dhujegl, fngfnuz, qdzbmhn, usbjyly
   xxoqrj (46)
   rscnige (65)
   dhujegl (34) -> mlavfvc, fxpic, fbvvzp, qinwdk, acsqtk, pjukxu, iulkkfp
   qgufw (74)
   cznqutl (99)
   evpfdj (37)
   pfjvzzw (91)
   ffvahj (47) -> qdxpkx, vmvjl, qfggzok
   yfouoak (56) -> vfbhl, jjpco
   qntqokn (8)
   kebefwy (246) -> jguhhsb, jpcurr
   hbozym (48)
   infll (59)
   wvysxc (95)
   ospcnv (14)
   nvoys (86)
   efvvtgo (185) -> zegoosj, tlyncze
   lhqhx (73)
   yqpivvl (17)
   hcajnu (23)
   tgtjhg (25)
   viqhzr (98)
   yygyfi (155) -> jddzj, qcako, frzwdkn
   yzjmm (36) -> ldakuz, fivaym
   kialkdr (19)
   gdibw (12)
   rdngdrd (80)
   lgurkym (337)
   ddsmt (87)
   rkdopb (82) -> todbu, sahfob, uaxomk
   xslucv (51)
   bfcab (76)
   gnjkpwf (947) -> zayqjx, smkcc, lhkoebz, ivcqfao
   iadezq (7)
   ckgmjsg (44)
   tqxfj (79)
   nmwrqbx (55) -> obejsk, nsabyg
   mepeg (21)
   iuzfnx (70)
   bfphqmo (99)
   myypsh (97)
   ykcxtea (86) -> cpwfem, vularzu
   yhhob (81)
   fcutr (85)
   rjfqyz (71) -> rfvtfs, xlufw
   ryrig (59)
   fzzyjt (202)
   tyjrdme (321) -> zngystc, jfapwfu, qskbft, pvqfa
   ywxkr (65)
   vjdrrnk (45)
   tptcl (61) -> krxpma, rtstdkd
   tnxxb (59)
   zrsya (17)
   jprkymy (23)
   icdyfw (37)
   iovan (1882) -> wppgjkw, rkdopb, ehjpn
   qeijcl (12)
   izfqx (47)
   mwdqdbu (54)
   txeege (37)
   onqnmbp (27)
   isuevmr (221) -> sphktgz, gjauauy, bncsnst
   ohohls (57)
   kwaqrgu (94)
   mfmrv (6)
   dzjwel (65)
   ibfbn (75) -> hquuw, sreeeqf, usixdl, rsvcn
   uzjoy (38)
   jhzoyme (91)
   loyjp (62)
   vazst (45) -> ymfwoto, hxtbym, lfszf
   jkhruz (15)
   ioyesxg (132) -> wjgdz, cvkmmqc, shifzsw, zoqmn
   veyvaoh (7)
   cpoxc (217) -> wqobawc, shilhu
   zvzdrp (7)
   hydfd (21)
   tygpx (21)
   juvwvsn (53)
   phswa (176) -> xikuc, clyht
   fhhzvwj (20)
   vldursw (145) -> rsjmc, juvwvsn
   ocmac (54)
   dchobfa (12) -> ullsjlc, cznqutl
   onlnhb (71)
   ftolbk (183) -> pagsex, wrbtgkb
   flrdpaj (92)
   vmvjl (67)
   kqcog (48) -> bcswm, bpuiaqr
   cstnc (79) -> bubhosg, tvbswr, hswdm, yfkyv
   vuazmuj (23)
   eincbt (52)
   wzjsbdm (62) -> sytjgl, tfuuzgi, bfphqmo, vcmntc
   dvyohbc (85)
   zwoqof (34)
   wqtbb (76)
   gkvrrq (77) -> izfqx, bvwdckm
   xivvpur (20)
   jxzyc (141) -> nvwknv, immcgrm
   ufqlean (28)
   todbu (87)
   qdmop (85)
   thtnmkb (95) -> adjfke, zbthq
   ikzqhu (50)
   jcyxjwa (98) -> agjdl, dtiprc, qaugj
   horfum (78)
   dayjxl (10)
   vczph (50)
   alpas (17) -> dgkhq, izsgfu, gktepby, iwotig
   dqrsxx (81)
   ixvot (54)
   hoagrj (99)
   dwztnh (27)
   uodmc (727) -> atwsafs, hwqhsc, wlibbwd
   dqyaco (32)
   bkfqmqn (70)
   dlactl (127) -> jkhruz, lizkruo
   kuivtq (311)
   wkkqsy (80)
   szkgky (76) -> psjbb, beigkn
   wutzd (168) -> guzycwt, tnxfqf, csotuo
   rlrcvv (128) -> hkelse, ljihfp
   vtneuhy (76)
   exbgy (159) -> veuqzjh, oynlkiy, oieuzv, tgtjhg
   bjrfinh (97)
   hsdkmdv (50286) -> unhnq, crsjegg, abfkpur, qfqnrvt, etsxvmj
   masck (61)
   vrbss (34)
   ytqwzv (68) -> qfaubqr, fyxdfod
   kvxtl (26)
   ibqenc (71)
   zsckv (6579) -> iscnnvh, pqxpguz, wqudy
   splhdhe (80)
   raloti (104) -> sgcmty, pgscbge
   sreeeqf (84)
   tqnqxx (19)
   xaskpny (79)
   gbauyfh (6)
   exiwwbx (12)
   phmqb (7)
   bydmdru (60)
   zwqpx (6)
   ehazo (1097) -> heiejhm, fwbly, gyivxga, wjhgb
   zudhbe (168) -> ndtsa, ecagt
   fncsm (46)
   zhkmnxk (21) -> ytlzs, ukhyz, cphgovc, vruhp
   cqifjd (189) -> knsphtv, qgufw
   vcllnn (244) -> dkbycez, jxzyc, qtfroa, ucqpz, wjovhv, pxfpf, orawnkw
   arqqbb (19)
   dsstjf (100) -> cvchqoz, jirnr
   bjfou (6)
   gokngb (50)
   qupaz (76)
   opkjkav (51)
   fgayln (257)
   jzdtwf (7)
   dbdrdzo (83)
   sytjgl (99)
   nthqzh (31)
   ndwvmg (235) -> qeijcl, kyhace
   gwwjmo (575) -> mdauzot, yfouoak, qkrirn
   evofb (24)
   ugoetwf (43)
   zrqzlvd (42) -> eavfy, tcbrhdi
   djyks (81)
   gwsceo (9) -> beiih, guipj, xzjcf, ktiuc, iovan, ygbphkw, abeinmv
   qdlcvk (61) -> dvyohbc, yynji
   lvwwxt (87)
   fngfnuz (1222) -> vehan, yygyfi, vpnfkw, gnxiznu, ooeypdy
   dfnak (6645) -> cxfvbz, oacoxb, rsttknu
   pftmymi (13)
   ikhsv (39)
   quyasfd (63) -> xbxqoh, kdajj
   ntodfz (172)
   krxpma (47)
   xpzzkdb (34)
   dtmhqm (49)
   hquuw (84)
   tfuuzgi (99)
   rbmoj (88)
   tfshhr (55)
   nxygf (28)
   wvxvu (50)
   chczyg (85)
   djktoc (77)
   ttborca (51)
   pvcpmx (137) -> jjpnqsk, gseohkk
   fwudfax (27)
   vyzhqx (62) -> eewbbvo, hocfv
   dvzguq (140) -> ulzcu, dvzoq
   rhwfl (74)
   mfohmwu (344) -> dniumoe, uuimn, ewiugad, vkkds, bqpycy
   lskrih (177) -> splhdhe, rdngdrd
   vihjl (46)
   adjfke (88)
   brubv (76)
   rzwkjvu (47)
   iyekup (1248) -> ignblg, ebhzgav, ygzas
   uryldo (749) -> mqtxqmz, mwbvrhn, zudhbe
   vorviq (176) -> jzdtwf, veyvaoh
   vsojq (76)
   ilnlkpv (93)
   tzdntld (49)
   tuefd (209) -> kqcog, hhfgih, nnbokwt, pwyspt, txayxeg, tsahe, ygwxr
   bmzeddf (259)
   sqfue (55)
   ndebha (76)
   ulzcu (17)
   tlmnwl (474) -> nidvi, alpas, urexzjf, ftolbk, efulo
   thwgxk (50)
   soxzrwm (83)
   #+end_example
** Day7-Common
   fwft (72) -> ktlj, cntj, xhth
   #+name: day7-com
   #+begin_src python :results output :var data=init_day7
     sdata = data.splitlines()
     class tower():
         def __init__(self, tower_dat):
             self.ats = dict()
             for entry in tower_dat:
                 sentry = entry.split()
                 self.ats[sentry[0]] = atlas(*sentry)
             self.root = self.ats.copy()
             for at in self.ats:
                 for fn in self.ats[at].friends_list:
                     self.ats[at].add_friend(self.ats[fn])
                     if fn in self.root:
                         del self.root[fn]

         def find_root(self):
             if len(self.root) == 1:
                 return self.root.keys[0]
             else:
                 return False


     class atlas():
         def __init__(self, name, weight, *friends):
             self.name = name
             self.weight = int(weight.replace('(','').replace(')',''))
             if friends == None:
                 self.friends_list = None
             else:
                 self.friends_list = [s.replace(',','') for s in friends[1:]]

             self.friends = []
             self.tweight = None

         def find_friend(self, friend_name):
             if self.name == friend_name:
                 return self
             for friend in self.friends:
                 res = friend.find_friend(friend_name)
                 if res != None:
                     return res
             return None
         def add_friend(self, friend):
             self.friends.append(friend)

         def get_unbalanced(self, p_goal=0):
             w0 = None
             w1 = None
             w_goal = None
             for f in self.friends:
                 if w0 == None:
                     w0 = f.get_tweight()
                 elif w0 == f.get_tweight():
                     w_goal = w0
                     break
                 elif w1 == None:
                     w1 = f.get_tweight()
                 elif w1 == f.get_tweight():
                     w_goal = f.get_tweight()
                     break

             for f in self.friends:
                 if w_goal != f.get_tweight():
                     res = f.get_unbalanced(w_goal)
                     if res != None:
                         return res
             w_diff = p_goal - w_goal * len(self.friends)       
             return self.name, w_diff



            

         def get_tweight(self):
             if self.tweight != None:
                 return self.tweight
             self.tweight = self.weight
             for f in self.friends:
                 self.tweight += f.get_tweight()
             return self.tweight

     t = tower(sdata)

   #+end_src

   #+RESULTS: day7-com

** day7a
   #+name: day7a
   #+begin_src python :results output :var data=init_day7 :noweb yes
   <<day7-com>>
   print(t.root)
   #+end_src

   #+RESULTS: day7a
   : {'xegshds': <__main__.atlas object at 0x7fa335226040>}

** day7b
   #+name: day7b
   #+begin_src python :results output :var data=init_day7 :noweb yes
     <<day7-com>>
     for n in t.root:
         res = t.ats[n].get_unbalanced()
         print(t.ats[n].get_tweight())
     print(res)

   #+end_src

   #+RESULTS: day7b
   : 510014
   : ('fabacam', 299)

* day8
** init_day8
   #+name: init_day8
   #+begin_src python :results value :cache yes
   from lib.autoloader import Autoloader
   puz_data_url = "https://adventofcode.com/2017/day/8/input"
   al = Autoloader(puz_data_url)
   al.connect()
   data = al.fetch()
   return data
   #+end_src

   #+RESULTS[d48bd3322d4659b0eddc959e22a443ebb644f284]: init_day8
   #+begin_example
   yxr inc 119 if nev != 6
   piw dec -346 if tl != 4
   cli inc 165 if nev >= -5
   nev dec 283 if xuu > -2
   tem inc 745 if qym >= -9
   xuu dec -104 if cli == 165
   h dec 192 if u <= 5
   ln dec -616 if ej > -7
   tem dec -555 if ar > -5
   tem dec 687 if tl > -8
   h inc 120 if re < -8
   bq dec -410 if ej > -4
   re dec 476 if tem == 613
   ej dec 686 if cli != 163
   ar dec 676 if tl > -6
   nfo inc 633 if s == 0
   tl inc -471 if tem > 607
   bb inc 157 if piw > 342
   cli inc -830 if piw != 342
   piw inc -645 if ar >= -674
   bq dec 304 if piw != 356
   u inc -274 if bb != 147
   yxr inc -520 if ec >= 1
   ec dec 631 if bb > 147
   ar dec 732 if s >= 0
   foz inc -617 if bb == 157
   qym dec -197 if ej == -686
   bb dec 111 if h <= -199
   ln dec -585 if re != -476
   foz dec -181 if nev < -280
   foz dec 989 if xuu != 106
   ec inc -930 if ec <= -626
   foz dec 862 if s >= 5
   tem inc 241 if xuu == 104
   ar dec -460 if h >= -201
   cli inc -317 if cli == -665
   bb dec -483 if h > -194
   tem inc -718 if tl <= -466
   ln dec 362 if hb == 0
   qym inc 95 if hb > 3
   piw dec -463 if ln < 246
   xuu inc 159 if s <= 5
   ec inc -710 if cli < -977
   bb inc -98 if xuu >= 260
   qym inc 159 if bb >= 540
   acc inc 610 if fe <= 9
   ar dec 381 if ej < -695
   acc dec 807 if nev > -284
   foz dec 926 if h < -188
   tl inc 279 if ar != -957
   ec dec -39 if acc < -191
   u dec -110 if piw == 346
   ej dec 980 if ar == -948
   ln dec -165 if hb < 2
   nfo inc -370 if tem > 128
   ar dec -886 if ar < -947
   bb dec 624 if ej == -1666
   tl inc 36 if ec > -2227
   yxr dec 320 if cli <= -976
   tem inc -808 if ar >= -52
   cli dec 213 if h >= -198
   ej inc -141 if nev < -281
   bq inc -736 if yxr > -211
   u dec -742 if nfo > 258
   bq dec -727 if ar >= -64
   u dec -248 if bq > 89
   xuu inc 431 if yxr > -203
   hb dec -407 if hb >= -7
   ar inc 789 if acc >= -197
   yxr inc -753 if piw <= 350
   piw dec -973 if yxr >= -956
   xuu dec 457 if ec <= -2228
   bq inc -201 if bq >= 97
   bq dec -923 if ar == 727
   cli inc -560 if piw < 1329
   ej dec -150 if ar != 733
   h inc -198 if nev == -283
   u inc -388 if piw == 1319
   hb inc -212 if s < 8
   xuu inc -988 if ej < -1653
   ec inc 58 if re >= -485
   hb inc -126 if xuu < -741
   ar inc 534 if nev == -273
   fe inc 668 if s <= 7
   tem dec 25 if h >= -390
   u inc -632 if tl > -198
   u dec 721 if bq > 813
   piw dec -299 if foz >= -2348
   hb inc -407 if ej > -1663
   h dec 563 if foz == -2351
   bb dec 362 if fe != 670
   nev inc -512 if bb != -437
   fe dec -419 if yxr < -948
   tl dec 576 if ej > -1665
   acc dec -510 if xuu > -759
   s dec -108 if u < -906
   xuu dec -407 if xuu < -748
   yxr dec 771 if bb > -454
   u dec -879 if tem != 110
   bq inc -759 if u < -27
   s dec -295 if qym < 364
   qym inc 807 if xuu == -344
   h inc 545 if hb == -338
   ej inc -896 if s != 394
   s dec -961 if yxr > -1723
   s dec -142 if nev != -799
   s inc -692 if ln != 427
   ar dec 152 if tl == -763
   acc dec 304 if piw != 1328
   ar inc -532 if piw != 1324
   bq inc 124 if tem < 109
   h inc 480 if nfo == 268
   xuu dec -291 if ej >= -2556
   hb inc -56 if nfo >= 257
   ar dec -656 if bb > -447
   tl dec -458 if ec <= -2167
   xuu inc -100 if hb <= -397
   nev dec 384 if foz <= -2344
   acc dec -779 if acc == 9
   u inc 949 if h != -416
   xuu inc -865 if nev < -1182
   nev dec 317 if bb < -434
   foz inc -786 if bq > 51
   xuu inc -901 if ej >= -2557
   nev dec 750 if h != -398
   qym dec 783 if re != -480
   bb dec 54 if cli < -1752
   tl dec -803 if yxr < -1724
   s inc 690 if xuu != -954
   piw inc -667 if s != -151
   foz dec -946 if cli <= -1757
   h dec -885 if re == -486
   ar inc -765 if re < -468
   h dec 340 if ec != -2170
   fe dec 440 if tl > 492
   re dec 398 if hb != -384
   xuu inc -49 if fe > 641
   s dec 623 if qym != 375
   piw inc 429 if ec == -2174
   ej inc 747 if hb != -394
   xuu inc 761 if nfo > 255
   re inc 519 if yxr != -1716
   nev inc 863 if tl <= 499
   qym inc -357 if foz > -3138
   tl dec 186 if u < 915
   s dec -442 if nev < -1373
   bq inc -999 if ec == -2174
   cli inc 735 if acc > 781
   ar dec -983 if nev >= -1389
   cli inc 285 if u < 917
   xuu inc -970 if h >= -747
   bq inc 716 if tl < 310
   xuu dec 984 if bb > -503
   h inc -881 if ej >= -2546
   u inc 719 if fe >= 646
   u inc 396 if hb > -393
   ej inc 734 if acc != 784
   fe inc 581 if re <= -350
   piw dec -69 if hb < -384
   ec dec 540 if acc < 798
   cli dec -615 if foz <= -3130
   ln inc 261 if foz <= -3130
   acc dec 739 if ar > 1065
   ln dec -520 if qym > 19
   re inc -260 if bq != -230
   ln inc -28 if h > -750
   hb dec -794 if s == -325
   nfo inc 79 if ln < 1176
   acc inc 173 if ec == -2714
   yxr inc 756 if re > -616
   re inc 415 if fe >= 1219
   hb dec -701 if u < 1638
   xuu dec -325 if re != -200
   ln dec -552 if piw != 1157
   yxr inc -568 if qym >= 17
   tl dec 756 if ec <= -2712
   nev dec 430 if xuu <= -1219
   bq dec -580 if yxr >= -1533
   ej dec -357 if bb >= -493
   ec inc 722 if ej >= -1822
   tl dec 168 if nev == -1813
   bb dec -393 if foz >= -3130
   cli inc -298 if s == -328
   h inc 885 if yxr != -1536
   nev dec -188 if cli < -427
   yxr dec 41 if cli > -416
   qym inc 748 if u == 1632
   re inc 457 if nfo > 339
   yxr inc 781 if piw < 1153
   qym inc 628 if cli != -417
   bq inc -476 if piw < 1142
   bb dec 547 if nfo >= 341
   s dec 590 if piw == 1150
   piw inc -804 if nfo != 342
   ar dec -838 if xuu == -1226
   ec inc 224 if h > 132
   ec dec -963 if ln >= 1731
   xuu inc 109 if u <= 1638
   s dec -191 if fe >= 1220
   ln dec -718 if h >= 133
   u dec 46 if nev >= -1811
   nfo inc -56 if s < -718
   nev dec -346 if ar != 1905
   h dec -501 if hb != 306
   acc dec 651 if bb >= -1039
   xuu dec 714 if ar > 1905
   qym dec 304 if piw <= 1157
   tl dec -62 if foz < -3138
   h inc 448 if qym != 1095
   hb inc 780 if tem != 112
   hb dec 332 if tem <= 114
   s dec -447 if acc != 226
   s dec -560 if ej > -1829
   nev dec -435 if piw == 1150
   nev dec 259 if piw < 1155
   tem inc 293 if nfo == 286
   hb dec 656 if s < 284
   hb inc -484 if acc < 213
   ln inc 831 if s < 280
   hb dec -394 if ec != -1771
   nfo inc 124 if h != 628
   ln dec -675 if yxr < -754
   bb dec -69 if hb == 494
   ln inc -139 if re <= 261
   nev inc 325 if yxr >= -753
   tl inc 551 if foz != -3137
   bb dec -598 if nfo != 413
   qym inc 771 if s >= 271
   tl inc 903 if ej != -1820
   fe inc -388 if re != 250
   ln dec -163 if ej != -1827
   nev dec -209 if re <= 261
   bq inc -59 if h == 638
   ej inc 793 if yxr < -749
   ec inc -224 if s >= 276
   ln inc 895 if foz <= -3132
   acc dec -681 if ec < -1989
   tem dec -161 if hb == 493
   ar dec -436 if nfo >= 408
   u dec -56 if re != 250
   nfo inc -497 if hb < 495
   ec dec -874 if acc > 911
   bb dec 988 if xuu == -1838
   nfo dec -257 if fe > 836
   ec inc -332 if foz >= -3146
   u inc 697 if u <= 1691
   ej dec 777 if bb <= -440
   nfo dec -99 if bq > -277
   acc dec 552 if tem <= 573
   fe dec 74 if ec == -2317
   qym dec 829 if foz >= -3146
   bq dec -149 if ec <= -2324
   u dec -99 if hb == 493
   yxr dec -546 if tl > 288
   u inc 261 if cli >= -412
   ej inc -341 if tem < 574
   ec inc -83 if ar <= 2346
   ec inc 847 if xuu <= -1830
   re dec -364 if xuu < -1839
   yxr inc -483 if ln <= 4033
   tl dec 965 if tl == 286
   re inc -63 if tl >= -674
   cli inc 708 if acc < 352
   xuu dec 494 if ej > -2154
   tl inc 8 if foz > -3131
   ec inc 983 if nfo == 170
   bb inc 486 if cli < 292
   ar dec -461 if ec >= -586
   yxr dec -852 if hb < 500
   u inc -874 if acc < 355
   xuu inc 883 if re > 266
   xuu dec 809 if ec == -577
   tl dec 144 if ej > -2145
   u inc -363 if fe >= 839
   bb inc -194 if piw >= 1150
   ln inc 780 if fe != 835
   cli inc 213 if re >= 256
   xuu dec -718 if hb >= 491
   yxr dec -730 if u < 1251
   nfo dec 1 if hb > 491
   ar inc -556 if nev > -1085
   ej dec -275 if bq < -128
   nev dec -578 if foz != -3137
   h inc -391 if h == 638
   foz inc -291 if bq >= -134
   bb inc -123 if fe == 840
   tl dec 72 if bq == -133
   qym dec -155 if yxr < 831
   re inc 515 if s < 289
   nfo dec -313 if ar >= 2242
   cli dec 486 if tl < -904
   bb dec -844 if ln >= 4810
   hb inc -551 if tem == 565
   ec inc -28 if yxr <= 828
   cli inc -673 if h >= 241
   re dec -937 if bb > 562
   ec inc 214 if bb != 571
   piw inc -142 if ar > 2240
   ar dec 750 if tl < -898
   re dec -844 if ej != -1877
   bq inc -17 if qym <= 1200
   acc dec -154 if foz > -3429
   piw inc -13 if cli > -175
   cli inc -374 if acc > 497
   acc dec -751 if ln != 4821
   xuu dec 821 if bq < -142
   nev dec 867 if bb < 565
   qym dec -883 if hb != -65
   h inc -289 if ln <= 4818
   hb dec 839 if s <= 282
   cli dec 662 if ar > 2253
   nev inc 975 if acc < 1249
   foz inc -459 if nfo != 479
   tem inc 721 if ar < 2244
   hb dec 645 if bb >= 561
   cli dec 973 if bq <= -148
   qym inc 937 if piw <= 1003
   bq inc -548 if tem != 561
   nfo dec 98 if nev != -1082
   u dec 789 if bq >= -688
   u dec 389 if acc <= 1258
   bq inc 818 if qym <= 3020
   acc inc 224 if nfo < 492
   ln inc -739 if re >= 2547
   re dec -364 if fe != 843
   piw dec -836 if piw > 991
   foz inc 484 if cli < -1519
   ln inc 869 if hb < -1533
   piw dec 872 if yxr <= 834
   bq inc -1 if bq >= 113
   tl inc -649 if u >= 854
   ec dec -447 if bb == 566
   ar dec -702 if u < 861
   s inc -445 if bb <= 574
   xuu dec 323 if cli <= -1523
   foz dec 589 if ln <= 4947
   s inc -399 if nfo != 484
   cli inc -704 if acc < 1481
   yxr dec 712 if hb != -1534
   nev dec -347 if nev <= -1087
   ln dec -801 if foz > -4480
   xuu dec -549 if h >= -47
   re dec 127 if xuu > -2692
   hb inc 96 if fe <= 845
   acc dec 159 if hb >= -1451
   bq inc 754 if u >= 865
   u inc 23 if yxr > 106
   re dec 940 if nfo <= 489
   qym dec -599 if ar >= 2948
   qym dec -481 if nfo == 482
   nfo inc 767 if cli <= -2225
   bb inc -174 if ec == 56
   tem inc 615 if ec <= 55
   tem inc 845 if re > 1848
   hb inc 940 if tl > -1543
   bq dec -892 if xuu >= -2686
   bq inc 996 if bq >= 117
   re dec 456 if u < 885
   ln inc 879 if s < -568
   s dec 605 if ar >= 2941
   foz dec 585 if hb > -1449
   ej inc 980 if ej <= -1866
   re dec -409 if foz <= -5059
   tem dec -394 if nfo != 476
   yxr dec -765 if ej <= -888
   ec inc -540 if fe < 843
   cli dec 758 if foz != -5056
   nfo inc 846 if re > 1802
   re inc 800 if nev < -1078
   nev dec 2 if yxr < 883
   piw inc 282 if acc >= 1313
   h inc -993 if ln <= 5741
   ar inc 594 if tem <= 1804
   h inc 502 if h >= -45
   xuu inc -73 if acc <= 1326
   re dec 116 if piw >= 1243
   bq inc 62 if u <= 880
   acc dec 166 if fe <= 846
   ec dec -441 if re > 2612
   re inc 214 if re != 2602
   u dec 410 if s < -1160
   ln dec -701 if piw <= 1244
   tl inc -126 if nfo <= 1330
   fe inc -861 if tl <= -1669
   ar dec -998 if yxr <= 882
   fe inc 629 if ln > 6445
   hb dec -407 if foz <= -5071
   s dec 654 if acc <= 1161
   bb inc 304 if fe <= 615
   xuu inc 979 if cli == -2969
   cli inc -973 if fe == 607
   cli inc 859 if tl <= -1665
   tl dec 257 if foz > -5064
   bq dec -253 if hb != -1446
   s inc 82 if fe == 611
   h inc -462 if xuu == -2761
   nev dec 231 if bq <= 1123
   fe inc -719 if re == 2817
   nfo inc 553 if ec != -484
   nev inc -457 if nfo != 1318
   fe inc -936 if piw <= 1247
   nev inc -615 if ar > 4539
   fe inc -267 if ec >= -475
   qym dec 336 if tem > 1802
   ej inc 442 if foz > -5064
   qym inc 864 if h < 0
   nev inc 565 if foz >= -5057
   tem inc 257 if ej <= -457
   hb dec -202 if piw > 1243
   bq dec -192 if ar != 4550
   foz dec 374 if ln >= 6454
   tem inc 381 if ej != -454
   ec dec -630 if ej == -438
   foz dec -821 if acc > 1161
   nev dec 903 if bq != 1315
   re inc -677 if ej > -448
   re inc 588 if u < 473
   xuu dec 114 if foz > -5062
   acc inc -804 if ec > -492
   nfo inc 728 if cli == -2120
   xuu dec -258 if foz > -5064
   tem dec -370 if ln < 6450
   acc dec -717 if ej != -442
   ec dec 262 if qym > 4613
   nev inc 31 if u >= 468
   xuu dec 84 if re == 2728
   u inc 457 if xuu != -2697
   acc dec 251 if acc != 1068
   tem dec -745 if acc <= 1076
   tl dec 581 if tem <= 3304
   s dec -730 if hb <= -1444
   ec dec 409 if tem < 3293
   acc dec -884 if acc >= 1077
   acc inc 160 if bb < 706
   ar dec 110 if nfo != 2058
   ej dec -349 if fe < -1038
   s inc 681 if s >= -1096
   cli inc -712 if fe < -1043
   nfo dec 693 if u != 924
   ln inc 170 if xuu != -2702
   bb inc 759 if tl > -2518
   ln inc 647 if tem > 3296
   ej inc -35 if re >= 2734
   qym inc 710 if nev < -3258
   xuu inc 304 if fe == -1052
   piw dec 237 if xuu >= -2707
   tem dec -683 if hb <= -1441
   piw inc -297 if re >= 2733
   nfo dec -836 if bb == 1455
   s inc 901 if u <= 921
   bb inc 780 if bq == 1307
   xuu dec 467 if yxr >= 878
   acc dec -24 if h < 6
   ec dec 412 if foz >= -5054
   ec inc -990 if fe == -1047
   nev dec -940 if nfo != 2208
   ar dec -670 if qym == 5339
   foz inc 391 if hb != -1438
   yxr inc -86 if acc <= 1260
   qym dec -36 if piw < 1008
   nev inc -21 if yxr == 788
   piw inc 581 if hb == -1446
   bb inc -355 if bb != 2232
   yxr dec 238 if ar < 4441
   tem dec -974 if cli < -2826
   xuu inc -237 if s <= -406
   ej dec 51 if foz <= -4661
   cli inc -416 if h < 6
   fe inc 23 if s < -407
   bq dec 598 if ej <= -152
   cli inc -15 if piw > 1584
   foz dec -781 if nfo < 2209
   u inc 17 if bb < 1883
   xuu dec 799 if ej >= -157
   bb inc 914 if tem != 4960
   foz dec 853 if fe != -1024
   piw dec 628 if nfo != 2199
   qym dec 303 if xuu >= -4207
   bq dec 854 if yxr >= 549
   hb inc -123 if xuu >= -4211
   bb inc 767 if nev <= -2318
   s inc 482 if nfo > 2196
   yxr inc 185 if bb < 3570
   yxr dec 683 if bq != 444
   fe dec -316 if ec >= -1733
   bb inc 368 if s < 78
   tl dec 132 if yxr != 63
   yxr dec 357 if bq == 453
   fe inc -256 if ec > -1744
   xuu inc -193 if ej <= -142
   xuu dec -605 if cli != -3263
   ar dec 571 if u != 945
   nfo inc -430 if nfo < 2209
   hb inc 236 if hb > -1564
   ar dec -460 if fe < -1278
   tl dec -127 if bq > 449
   s inc -343 if nfo > 1764
   fe inc 761 if nev < -2326
   piw dec -136 if xuu != -4391
   cli dec 639 if yxr >= -301
   tl dec -524 if ar != 4890
   ln dec -75 if ln < 7269
   ln dec -376 if tem > 4956
   yxr inc -317 if yxr >= -297
   tem inc 593 if ej == -149
   cli dec 297 if ar < 4894
   ej dec -576 if xuu <= -4395
   bq dec -681 if s >= -277
   ec dec -404 if u >= 939
   xuu dec -82 if yxr >= -292
   nev inc -661 if u <= 954
   yxr inc 941 if foz > -3896
   ar dec 559 if ar < 4895
   re inc 470 if tl <= -1981
   qym inc 423 if hb <= -1564
   ec inc -353 if cli >= -4208
   qym inc 166 if nfo < 1770
   ln inc 110 if h > -4
   bb dec 459 if nfo < 1776
   tem inc -466 if ej > 418
   tem inc -223 if fe < -1271
   bb inc 361 if qym > 5650
   fe dec 698 if nfo <= 1768
   h inc -761 if acc >= 1258
   tl dec 307 if cli < -4195
   ec dec -428 if bq == 1134
   ec inc 200 if u == 945
   fe dec 999 if re >= 3198
   ej dec -150 if ej != 429
   ar inc -19 if bb < 3822
   cli inc -271 if piw == 1721
   piw inc -317 if nev <= -2985
   xuu dec 732 if xuu == -4393
   ar dec -738 if bq != 1133
   cli dec -925 if xuu >= -4400
   tem dec -336 if acc == 1261
   xuu dec -396 if tl < -2291
   tem inc -726 if xuu < -3995
   xuu inc 586 if yxr < 643
   nfo inc 554 if re >= 3194
   ln dec 425 if s < -276
   s inc -678 if h >= -2
   acc inc -669 if u == 945
   nfo inc 136 if re <= 3207
   nev inc -486 if fe > -2272
   acc inc 146 if yxr < 650
   bq inc 637 if u != 945
   bq inc -562 if u < 949
   fe dec -164 if tem >= 4128
   ej inc -868 if ec > -1058
   foz inc -646 if ej < -295
   u inc 960 if bb < 3825
   ln dec -6 if ln > 7826
   bq dec 972 if acc > 723
   piw inc 958 if fe != -2115
   ln inc 179 if ln <= 7830
   foz inc 206 if bb <= 3828
   u inc -789 if bb > 3826
   nev inc -597 if ln <= 8005
   nev dec -112 if yxr <= 642
   ej inc 670 if s <= -942
   ec dec 623 if qym >= 5652
   bb inc 35 if nev != -3470
   u dec -50 if ej != 379
   ar dec 952 if tl != -2306
   tem inc -92 if re == 3192
   yxr dec 866 if qym == 5652
   nfo inc -457 if bb != 3876
   tem inc 395 if fe != -2125
   acc inc -37 if piw > 1711
   tem dec -647 if fe <= -2113
   tem dec -546 if xuu > -3422
   piw dec 219 if acc < 699
   ar dec -392 if piw == 1502
   s inc 330 if bq > -407
   bq inc -508 if nev <= -3473
   ln dec -333 if cli != -3545
   ln dec 42 if ec > -1683
   acc inc -247 if ln <= 7966
   foz inc 563 if tl <= -2287
   ej inc -390 if ej <= 384
   acc dec 659 if acc != 443
   xuu dec -293 if ej >= -18
   qym dec -169 if yxr > -217
   cli inc 778 if ln >= 7960
   xuu dec -179 if u != 163
   nfo dec 600 if ej == -11
   ar dec 261 if piw > 1492
   re inc -889 if yxr > -228
   h inc 37 if xuu != -2943
   ln inc 148 if tem > 5731
   bq dec 564 if piw == 1502
   piw dec 822 if ar != 4242
   xuu inc -35 if nfo != 1402
   u dec -284 if cli > -2777
   ar dec -521 if yxr >= -225
   bb dec 412 if yxr <= -222
   piw inc -199 if tem != 5715
   bb inc 331 if qym < 5653
   bq dec -359 if ec > -1687
   acc inc 298 if bq == -605
   bq inc -69 if tl < -2305
   h inc -626 if h == 8
   qym dec 609 if s <= -619
   fe inc 165 if nev < -3456
   xuu inc 690 if ej != -15
   ec dec -280 if tl < -2294
   qym dec 829 if bq != -610
   xuu dec 888 if piw > 489
   u inc 81 if acc > 80
   qym dec 247 if h > -9
   tl dec -558 if bq < -604
   nfo dec 692 if ln == 7963
   acc inc -23 if tl > -1735
   xuu dec 478 if fe == -1950
   s dec 551 if tl < -1736
   ec inc -479 if fe == -1950
   s dec -17 if foz > -3328
   piw dec 351 if acc == 84
   bq dec -437 if re == 2309
   qym dec -808 if cli > -2774
   h dec -390 if tl == -1738
   foz dec 676 if ej >= -4
   re dec 891 if bq != -167
   bb dec -191 if re != 1418
   nfo inc 380 if s == -1155
   ec inc 69 if u < 531
   nev dec -690 if s >= -1164
   s dec 571 if bb >= 3776
   re dec -224 if hb <= -1563
   bq inc -252 if piw < 131
   yxr dec -488 if tl == -1741
   re inc 755 if re > 1638
   bq inc -208 if qym != 4769
   qym inc 695 if hb == -1563
   fe inc -157 if piw < 121
   xuu dec 579 if acc != 79
   ln dec -262 if nfo > 1086
   ec dec 235 if tl >= -1739
   hb inc 188 if ej >= -13
   s inc 124 if cli >= -2760
   ec dec -643 if nfo != 1088
   re dec -934 if fe > -1959
   ej inc -58 if s == -1727
   qym dec -558 if tl >= -1746
   ln inc -555 if ec != -1402
   foz inc -833 if cli != -2774
   ln dec -589 if cli == -2775
   tl inc -906 if re < 3334
   tl inc 552 if fe < -1940
   cli inc 976 if re >= 3322
   bq inc -101 if xuu >= -3301
   nev dec -217 if tl < -2087
   ej dec 945 if u > 519
   piw inc 447 if fe >= -1957
   h inc 905 if piw <= 586
   hb inc -995 if u == 521
   acc inc 713 if tl >= -2100
   ar inc -936 if ec <= -1400
   tl inc 199 if u < 530
   u dec 584 if ar != 3829
   tl inc 787 if fe > -1954
   ar inc 631 if qym >= 5325
   tl inc -993 if ln < 8232
   bq dec 900 if yxr > -231
   u dec -226 if ln < 8235
   yxr inc -966 if bq <= -1520
   ar inc -83 if bq < -1520
   bq dec 439 if bq == -1528
   ej inc 608 if h < 1294
   yxr inc 140 if nev >= -2567
   qym dec 685 if nev >= -2566
   re dec 957 if hb > -2378
   tem dec -851 if bq <= -1966
   nfo dec 421 if qym < 4649
   acc inc 473 if ar == 4383
   tem inc -407 if qym >= 4642
   s dec -949 if tl >= -2103
   h inc 549 if s >= -784
   qym dec -311 if xuu >= -3308
   s dec 751 if yxr > -1060
   s inc -438 if ar != 4386
   fe dec 734 if s <= -1965
   ej inc 989 if hb == -2376
   tl dec 84 if yxr > -1055
   re dec 919 if ar < 4393
   ec dec 314 if qym >= 4657
   acc dec 572 if piw <= 579
   bq dec -742 if tem >= 6166
   ln inc 891 if qym < 4651
   piw inc 125 if s >= -1956
   nev inc 530 if piw != 577
   ln inc 703 if nfo <= 670
   bb inc 741 if foz >= -4155
   ln inc -429 if u >= 163
   ln dec -47 if nfo > 678
   cli dec 217 if bq < -1222
   tl dec -485 if fe >= -2690
   tl dec -948 if fe == -2684
   nfo inc 786 if qym != 4642
   bb inc 336 if re != 1455
   tl inc -8 if nfo != 1455
   hb inc 173 if bq == -1225
   s dec -53 if piw < 581
   bq inc 905 if h == 1842
   acc inc -450 if nev < -2551
   ar dec 241 if s != -1914
   bb inc 671 if ec <= -1400
   acc inc 895 if fe <= -2691
   fe dec 776 if s == -1913
   foz inc -104 if nev >= -2558
   nfo dec 629 if hb <= -2201
   u dec 531 if ec < -1404
   hb dec -37 if yxr < -1049
   foz dec -586 if h <= 1848
   nev inc -895 if acc == 248
   qym dec 475 if bb <= 4461
   piw inc 773 if fe < -3459
   nfo dec -142 if cli == -2008
   hb inc 103 if cli != -1999
   bq inc 795 if ln == 9390
   re dec 82 if nfo <= 975
   u inc -275 if u != 163
   xuu inc -599 if acc == 248
   ln inc -642 if hb < -2069
   hb dec 874 if nfo == 968
   bb inc -283 if ej != 640
   bq inc -999 if fe == -3460
   tem dec 670 if tem != 6174
   bb inc 890 if re > 1369
   xuu dec 880 if foz >= -3678
   ar dec -702 if ej == 641
   h inc -43 if nev != -3453
   tl inc -803 if qym >= 4166
   ej inc 583 if foz > -3687
   piw inc -517 if qym != 4173
   nev dec -258 if tl >= -1552
   tem inc -18 if ln >= 9398
   qym inc -463 if tem == 5497
   nfo inc -279 if ln >= 9392
   nfo dec 627 if ln > 9388
   acc inc -544 if ej >= 1219
   xuu dec 201 if foz < -3667
   qym inc -353 if s >= -1905
   xuu inc -927 if tem <= 5506
   cli dec -347 if bb != 5065
   tl dec -339 if hb == -2937
   s dec 503 if fe > -3470
   s dec -187 if acc > -306
   hb inc 77 if ej > 1214
   u dec 103 if acc > -296
   s dec 620 if bb < 5072
   fe dec -752 if bb == 5063
   u dec 930 if ec == -1410
   ec inc -235 if cli != -1661
   bq inc -361 if cli < -1664
   xuu inc -582 if s <= -2849
   re dec 812 if acc <= -292
   h inc -938 if cli != -1652
   ec inc -830 if re > 560
   ec dec -888 if ln < 9385
   cli inc -520 if tem < 5506
   qym inc -224 if acc >= -302
   tl inc -399 if nfo >= 342
   tem dec 154 if foz == -3671
   qym inc 500 if nev < -3443
   tem dec 603 if acc != -295
   nev inc 227 if ar == 4844
   fe dec 658 if s > -2857
   bb dec 327 if xuu < -6498
   s inc -204 if acc <= -294
   s inc 393 if s <= -3051
   foz dec -71 if ec == -2232
   piw inc 247 if acc != -306
   tl dec 749 if cli >= -2189
   bb dec -17 if qym != 3996
   acc inc 890 if bq != -524
   ar dec -532 if re == 561
   ej dec -406 if ej >= 1224
   ar dec -82 if hb < -2857
   ej inc -685 if u <= 163
   nfo dec -354 if yxr < -1053
   ar dec -346 if yxr >= -1048
   ej dec -575 if hb > -2864
   bq inc 220 if bq != -521
   fe dec -843 if cli <= -2185
   ej inc -819 if ln > 9390
   cli inc 105 if acc != -290
   bb inc -828 if hb > -2866
   s dec -508 if tem != 4900
   re inc 153 if re <= 566
   piw dec 370 if foz <= -3602
   nfo inc 987 if bb >= 3922
   fe inc -10 if foz > -3607
   nfo inc -687 if yxr > -1060
   nfo inc -580 if nev == -3226
   fe inc -661 if s <= -2149
   tl inc -521 if h == 896
   nev dec 891 if tem > 4891
   hb inc -162 if cli != -2076
   yxr dec 696 if nev == -4112
   tl inc 754 if s <= -2145
   bq inc -457 if re >= 706
   re dec -926 if acc >= -286
   u inc 630 if re <= 719
   ej dec -635 if u > 791
   ln dec 631 if ln != 9400
   qym inc 470 if re >= 722
   ej dec 419 if cli == -2076
   foz dec -108 if tl < -1201
   fe inc -162 if cli <= -2078
   ar dec 385 if yxr == -1059
   ec inc 695 if hb < -2852
   re dec 535 if cli > -2071
   ej dec 135 if bb < 3926
   ej dec 13 if hb != -2860
   ec inc 967 if ec < -1540
   ar dec 713 if ar >= 5453
   piw inc -38 if tem >= 4887
   piw inc 664 if bq == -761
   ar dec 767 if hb > -2863
   ej dec 908 if re > 715
   nev inc 905 if acc <= -291
   nev inc 395 if hb < -2854
   piw inc 850 if yxr > -1050
   tl dec 290 if nfo == 61
   re inc -770 if xuu < -6496
   fe inc 828 if ar == 3978
   fe dec -295 if ar != 3980
   fe dec 431 if foz >= -3506
   nfo inc -433 if piw == 1853
   tl dec -744 if acc > -299
   s dec -609 if bb <= 3919
   ar inc 390 if ec != -1547
   acc inc 404 if hb == -2860
   nfo inc -17 if s < -2152
   u inc 338 if h != 910
   s inc 921 if s >= -2159
   ec inc -49 if hb > -2863
   tem inc -144 if tem >= 4893
   nev dec -847 if qym > 3985
   yxr dec -885 if ln < 8762
   cli dec 10 if u == 1131
   tem dec -592 if yxr != -159
   ec dec -594 if re >= -57
   tem inc 66 if u == 1131
   foz inc -810 if u == 1131
   tem dec 880 if u > 1126
   bq inc -604 if acc == 108
   tem inc 344 if acc < 114
   foz dec -550 if ej != 1594
   ar inc 849 if s != -1233
   nfo dec -903 if u == 1123
   nev dec -945 if ec <= -987
   re dec 715 if nev < -1019
   ar dec -879 if hb == -2860
   tl inc 432 if bb != 3926
   s dec 474 if re <= -767
   ej inc 356 if h >= 896
   ec dec -229 if hb != -2863
   bq inc 121 if ec <= -756
   xuu inc 428 if u == 1131
   ej inc 796 if xuu >= -6070
   fe inc 889 if fe < -3341
   cli dec 524 if acc > 102
   piw dec -360 if acc != 117
   fe dec 907 if h >= 907
   piw dec -184 if ar != 6092
   u dec 189 if hb >= -2866
   nev dec -381 if nfo < -362
   hb inc -568 if re == -771
   hb inc -365 if xuu != -6079
   nev dec 490 if qym == 3995
   u dec 311 if u >= 933
   hb inc 692 if yxr == -166
   ej dec -524 if re > -767
   ln dec 5 if h > 896
   u dec 801 if u >= 628
   ar dec -861 if s < -1695
   nfo inc -921 if tem > 4862
   ej inc -57 if bq == -1244
   re dec 726 if ar == 6957
   yxr dec -344 if s == -1705
   ln dec -300 if foz != -3764
   bb dec -372 if bq >= -1251
   h inc 630 if tl <= -321
   ln inc -586 if u != -161
   ec dec -356 if ar != 6959
   u dec -225 if piw >= 2399
   ln inc -715 if tl < -321
   nev inc -649 if u < -164
   h inc 232 if ec != -407
   bq dec 689 if piw <= 2399
   bb inc 52 if xuu == -6071
   foz inc 8 if s == -1705
   fe inc 80 if nfo > -1299
   ec inc 686 if u <= -166
   foz inc 579 if bb < 4347
   piw dec -551 if nev <= -1288
   fe dec -271 if foz < -3743
   nev dec -386 if qym <= 3993
   nfo inc 791 if hb == -3101
   xuu inc -206 if xuu != -6081
   qym inc 53 if h > 1532
   hb inc -238 if piw != 2955
   h inc 947 if yxr < 181
   re inc 668 if h < 2484
   cli dec -989 if foz > -3754
   tl inc -495 if h <= 2486
   tl dec 884 if tl < -810
   s inc 405 if fe >= -2107
   ec dec 842 if yxr >= 174
   h inc -451 if yxr < 180
   yxr inc 364 if hb < -3331
   nfo dec -736 if xuu < -6272
   ec inc 37 if piw <= 2957
   cli inc 839 if piw <= 2955
   foz dec 787 if cli <= -777
   ar inc 343 if hb == -3339
   piw dec 939 if ej != 1892
   piw inc -36 if bq != -1927
   ej dec -684 if tl != -1710
   acc inc 882 if h == 2030
   re dec 372 if acc == 990
   h inc 23 if qym <= 4041
   ej dec 446 if u >= -169
   foz dec 293 if yxr <= 539
   tl dec -526 if fe > -2110
   ar inc 35 if ec <= -521
   ej dec -839 if s != -1295
   bq inc -816 if ec > -534
   tl dec -913 if fe >= -2108
   bb dec 888 if acc >= 983
   tem inc -951 if hb == -3339
   ec dec -562 if qym < 4046
   nfo dec -696 if h >= 2049
   u dec -376 if yxr == 542
   tem dec 130 if ej <= 3429
   nev inc -484 if h >= 2046
   nev dec -902 if yxr >= 539
   qym inc 306 if nev >= -498
   bq inc -306 if hb <= -3334
   tl dec -807 if fe > -2113
   nev inc -47 if nev <= -483
   u dec -228 if xuu == -6277
   hb dec 925 if s < -1297
   acc dec 236 if cli > -786
   h inc 684 if u >= 429
   nfo dec 912 if u < 440
   xuu inc 529 if bb < 3464
   tl inc 143 if qym != 4354
   ec dec 694 if tem == 3791
   fe dec -542 if u < 441
   piw dec 433 if yxr >= 540
   ln dec -537 if hb > -4272
   acc dec 419 if acc > 744
   xuu dec 31 if fe == -1557
   ej dec -297 if yxr < 533
   foz inc -281 if ec <= -656
   cli dec 712 if tl > 677
   bq dec -871 if foz >= -4817
   bb inc 381 if ln < 8294
   nev inc -670 if tem > 3783
   yxr inc 860 if nfo < 14
   foz inc -120 if nfo > 25
   ec inc 793 if fe >= -1563
   qym dec -827 if qym < 4351
   ar inc 687 if cli >= -1495
   bq inc 975 if re < -1191
   xuu inc 177 if u != 442
   tem inc 363 if nev != -1207
   acc inc 707 if cli < -1491
   nfo dec -381 if tem > 4148
   ec inc -347 if tl != 697
   ej dec 995 if s > -1303
   acc dec 452 if bq == -2080
   u dec -851 if piw > 1539
   ln inc -993 if re != -1211
   nfo dec -591 if tl >= 692
   s dec -410 if yxr != 549
   yxr dec -54 if u >= 1288
   bb dec -733 if re <= -1193
   piw inc -984 if re < -1193
   ln dec 133 if ec >= -211
   acc dec -218 if fe < -1561
   tem inc 792 if fe > -1567
   bb dec 359 if yxr != 541
   tem inc 273 if h != 2735
   ec inc -714 if nfo < 401
   hb dec -555 if bb <= 4206
   nfo inc -151 if ln > 7294
   hb dec -635 if yxr <= 550
   acc inc -603 if u < 1282
   nev inc 705 if cli >= -1488
   cli inc 568 if ej < 2435
   nfo dec 795 if nfo >= 246
   s dec -996 if ln != 7289
   u inc -530 if nfo > -550
   tl dec -431 if qym >= 5171
   fe inc -998 if ec < -920
   #+end_example

** day8-common
   #+name: day8-com
   #+begin_src python :var data=init_day8
     from collections import Counter
     import numpy as np

     class r_reader():
         def __init__(self, sdata):
             self.reg = Counter()
             self.ins_list = [instruction(s) for s in sdata]
             self.most_big = 0
         def run_all(self):
             for ii in self.ins_list:
                 ii.act(self.reg)
                 
                 _, cur_big = self.find_big()
                 if cur_big > self.most_big:
                     self.most_big = cur_big
         def find_big(self):
             big = None
             for item in self.reg:
                 if self.reg[item] > self.reg[big]:
                     big = item
             return big, self.reg[big]

     class instruction():
         def __init__(self, s):
             r, i, v, _, c1, op, c2 = s.split()
             self.r, self.v, self.c1, self.c2 = r, int(v), c1, int(c2)
             if i == 'dec':
                 self.v *= -1
             
             if op == '>':
                 self.op = np.greater
             elif op == '<':
                 self.op = np.less
             elif op == '<=':
                 self.op = np.less_equal
             elif op == '>=':
                 self.op = np.greater_equal
             elif op == '==':
                 self.op = np.equal
             elif op == '!=':
                 self.op = np.not_equal

         def act(self, reg):
             if self.op(reg[self.c1], self.c2):
                 reg[self.r] += self.v

     sdata = data.splitlines()
     rr = r_reader(sdata)

   #+end_src

** day8a
   #+name: day8a
   #+begin_src python :results output :var data=init_day8 :noweb yes
   <<day8-com>>
   rr.run_all()
   b = rr.find_big()
   print(b)
   #+end_src

   #+RESULTS: day8a
   : ('ar', 8022)

** day8b
   #+name: day8b
   #+begin_src python :results output :var data=init_day8 :noweb yes
   <<day8-com>>
   rr.run_all()
   print(rr.most_big)
   #+end_src

   #+RESULTS: day8b
   : 9819
* day9
** init_day9
   Note: Has to be rerun each time emacs restarted, data wouldn't transfer properly between code blocks
   #+name: init_day9
   #+begin_src python :results silent :session *day9*
   from lib.autoloader import Autoloader
   puz_data_url = "https://adventofcode.com/2017/day/9/input"
   al = Autoloader(puz_data_url)
   al.connect()
   data = al.fetch()
   print(data)
   #+end_src


** day9-common
   #+name: day9-com
   #+begin_src python :results output :session *day9*
     class d9_stream():
         def __init__(self, dat):
             self.dat = dat

         def remove_trash(self):
             in_trash = False
             trash_coords = []
             skip = False
             beg = 0
             tc = 0
             for ii, item in enumerate(self.dat):
                 if in_trash == False:
                     if item == '<':
                         in_trash = True
                         trash_coords.append((beg, ii))
                 elif skip == True:
                     skip = False
                 elif item == '!':
                     skip = True
                 elif item == '>':
                     in_trash = False
                     beg = ii+1
                 else:
                     tc += 1
             if in_trash == False:
                 trash_coords.append((beg,ii))

             new_dat = ""
             for coords in trash_coords:
                 new_dat += self.dat[coords[0]:coords[1]]
             self.dat = new_dat
             return tc

         def start_score(self):
             score = 0
             dep = 0
             for term in self.dat:
                 if term == '{':
                     dep += 1
                 elif term == '}':
                     score += dep
                     dep -= 1
             print(score)

     ds = d9_stream(data)




   #+end_src

   #+RESULTS: day9-com

** day9a
   #+name: day9a
   #+begin_src python :results output :noweb yes :session *day9*
   <<day9-com>>
   ds.remove_trash()
   ds.start_score()
   #+end_src

   #+RESULTS: day9a
   : 16869

** day9b
   #+name: day9b
   #+begin_src python :results output :noweb yes :session *day9*
   <<day9-com>>
   print(ds.remove_trash())
   #+end_src

   #+RESULTS: day9b
   : 7284

* day10
** init_day10
   #+name: init_day10
   #+begin_src python :results value :cache yes
   from lib.autoloader import Autoloader
   puz_data_url = "https://adventofcode.com/2017/day/10/input"
   al = Autoloader(puz_data_url)
   al.connect()
   data = al.fetch()
   return data
   #+end_src

   #+RESULTS[1ba1022726fa9d26e98a51631e92f7c7ee72a6d5]: init_day10
   : 206,63,255,131,65,80,238,157,254,24,133,2,16,0,1,3

** day10-common
   #+name: day10-com
   #+begin_src python :results ouput :var data=init_day10
     class rope():
         def __init__(self, dataset, simple=True):

             if simple:
                 self.items = dataset.replace(',', ' ').split()
             else:
                 self.items = [ord(c) for c in dataset]
                 self.items += [17,31,73,47,23]
             self.chain = list(range(256))
             self.rot = 0
             self.skip_size = 0

         def run_one(self):
             for l in self.items:
                 length = int(l)
                 self.chain[:length] = reversed(self.chain[:length])
                 skip = self.skip_size + length
                 if skip >= 255:
                     skip %= len(self.chain)
                 self.chain = self.chain[skip:] + self.chain[:skip]
                 self.skip_size += 1
                 self.rot += skip

         def run_64(self):
             for _ in range(64):
                 self.run_one()
                 self.skip_size %= len(self.chain)
                 self.rot %= len(self.chain)

         def dense_hash(self):
             dh = []
             chain = self.get_true_chain()
             for kk in range(16):
                 v = chain[kk*16]
                 for ii in range(1,16):
                     v ^= chain[ii+kk*16]
                 dh.append(v)
             return dh

         def get_ans_b(self):
             dh = self.dense_hash()
             dhs = [f'{s:00x}' for s in dh]
             ans = ''.join(s for s in dhs)
             print(ans)
             return(ans)
             


         def get_true_chain(self):
             rot = self.rot % len(self.chain)
             chain = self.chain[-rot:] + self.chain[:-rot]
             return chain

         def get_ans_a(self):
             chain = self.get_true_chain()
             print(chain[0]*chain[1])



   #+end_src

   #+RESULTS: day10-com
   : None

** day10a
   #+name: day10a
   #+begin_src python :results output :var data=init_day10 :noweb yes
   <<day10-com>>
   ro = rope(data)
   ro.run_one()
   ro.get_ans_a()
   #+end_src

   #+RESULTS: day10a
   : 9656

** day10b
   #+name: day10b
   #+begin_src python :results output :var data=init_day10 :noweb yes
   <<day10-com>>
   ro = rope(data, False)
   ro.run_64()
   ro.get_ans_b()
   #+end_src

   #+RESULTS: day10b
   : 20b7b54c92bf73cf3e5631458a715149

* END
# Local Variables:
# eval: (progn (org-babel-goto-named-src-block "startup") (org-babel-execute-src-block) (outline-hide-sublevels 1))
# End:
